import 'dart:async';

import 'package:flutter/material.dart';
import 'package:share_plus/share_plus.dart';

import 'commanbannerwidget.dart';

class Sundarkand extends StatefulWidget {
  const Sundarkand({super.key});

  @override
  State<Sundarkand> createState() => _SundarkandState();
}

class _SundarkandState extends State<Sundarkand> {
  int _currentIndex = 0;
  bool _isBlackBackground = false;
  final double _scaleIncrement = 0.1;
  bool _isAutoScrolling = false;
  double _scrollSpeed = 2.0;
  late Timer _scrollTimer;
  final ScrollController _scrollController = ScrollController();

  final bool _isSliderVisible =
      false; // State variable to track visibility of the slider button
  double _textScaleFactor = 20.0; // Default font size
  final bool _isEnglish = false; // State variable to track language
  Color _themeColor = Colors.orangeAccent; // Default theme color

  TextAlign _textAlign = TextAlign.center; // Default text alignment
  IconData _currentIcon = Icons.format_align_center; // Default icon

  void _changeTextAlignment() {
    setState(() {
      if (_textAlign == TextAlign.left) {
        _textAlign = TextAlign.center;
        _currentIcon = Icons.format_align_center; // Default icon
      } else if (_textAlign == TextAlign.center) {
        _textAlign = TextAlign.right;
        _currentIcon = Icons.format_align_right; // Right icon
      } else {
        _textAlign = TextAlign.left;
        _currentIcon = Icons.format_align_left; // Left icon
      }
    });
  }

  @override
  void dispose() {
    _scrollTimer.cancel();
    _scrollController.dispose();
    super.dispose();
  }

  // Method to share content
  void _shareContent() {
    String contentToShare = 'hi';
    Share.share(contentToShare, subject: 'Check out this blog!');
  }

  // Method to show a SnackBar and copy content to clipboard
  void _showCopyMessage() {
    const snackBar = SnackBar(
      content: Text('Content copied!'),
      duration: Duration(seconds: 2),
    );

    ScaffoldMessenger.of(context).showSnackBar(snackBar);
  }

  void _toggleAutoScroll() {
    setState(() {
      _isAutoScrolling = !_isAutoScrolling;

      if (_isAutoScrolling) {
        _scrollTimer =
            Timer.periodic(const Duration(milliseconds: 100), (timer) {
          if (_scrollController.position.pixels <
              _scrollController.position.maxScrollExtent) {
            _scrollController.animateTo(
              _scrollController.position.pixels + _scrollSpeed,
              duration: const Duration(milliseconds: 100),
              curve: Curves.linear,
            );
          } else {
            _scrollController.jumpTo(0);
          }
        });
      } else {
        _scrollTimer.cancel();
      }
    });
  }

  void _onBottomNavTap(int index) {
    if (index != 5) {
      if (_isAutoScrolling) {
        _toggleAutoScroll();
      }
    }

    setState(() {
      _currentIndex = index;

      if (index == 0) {
        _isBlackBackground = !_isBlackBackground;
      } else if (index == 1) {
        _textScaleFactor += _scaleIncrement;
      } else if (index == 2) {
        _textScaleFactor -= _scaleIncrement;
        if (_textScaleFactor < 0.1) {
          _textScaleFactor = 0.1;
        }
      } else if (index == 3) {
        _shareContent();
      } else if (index == 4) {
        _showCopyMessage();
      } else if (index == 5) {
        _toggleAutoScroll();
      }
    });
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: _isBlackBackground ? Colors.black : Colors.white,
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: _isBlackBackground ? Colors.black : _themeColor,
        leading: IconButton(
          onPressed: () {
            Navigator.of(context).pop(); // Navigate back
          },
          icon: const Icon(Icons.arrow_back, color: Colors.white),
        ),
        title: const Text(
          "सुन्दरकाण्ड",
          style: TextStyle(color: Colors.white),
        ),
        actions: [
          IconButton(
            icon: Icon(_currentIcon, color: Colors.white),
            onPressed: _changeTextAlignment,
          ),

          // ElevatedButton(
          //   onPressed: _changeTextAlignment,
          //   child: Text("Change Text Alignment"),
          // ),

          IconButton(
            icon: const Icon(Icons.color_lens, color: Colors.white),
            onPressed: () {
              _showColorSelectionDialog(); // Show color selection dialog
            },
          ),
        ],
      ),
      body: SafeArea(
        child: SingleChildScrollView(
          controller: _scrollController,
          child: Container(
            decoration: BoxDecoration(
              gradient: LinearGradient(
                colors: _isBlackBackground
                    ? [Colors.black, Colors.grey]
                    : [_themeColor.withOpacity(0.5), Colors.white],
                begin: Alignment.topCenter,
                end: Alignment.bottomCenter,
              ),
            ),
            padding: const EdgeInsets.all(15),
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                const SizedBox(height: 1),
                const CommanBannerWidget(
                  imagePath: 'assets/sahitya_images/sundarkand.jpg',
                ),

                Center(
                    child: _buildSectionTitle(
                        _isEnglish ? "श्री गणेशाय नमः" : "श्री गणेशाय नमः")),
                _buildSectionContents(
                    "|| सदा रामरामेति रामामृतम् ते सदा राममानन्द निष्यंदकंदम् पिबंतम् नमंतम् सुदंतम् हसंतम् हनुमंतमंतर्भजे तं नितांतम् || \n"),

                _buildSectionContents(
                  "श्रीराम राम रघुनन्दन राम राम ।\n श्रीराम राम भरताग्रज राम राम ।\n"
                  "श्रीराम राम रणकर्कश राम राम ।\n श्रीराम राम शरणं भव राम राम ॥२८॥\n"
                  "श्रीरामचन्द्रचरणौ मनसा स्मरामि ।\n श्रीरामचन्द्रचरणौ वचसा गृणामि ।\n"
                  "श्रीरामचन्द्रचरणौ शिरसा नमामि ।\n श्रीरामचन्द्रचरणौ शरणं प्रपद्ये ॥२९॥\n\n\n"
                  "लोकाभिरामं रणरङ्‌गधीरं राजीवनेत्रं रघुवंशनाथम् ।\n"
                  "कारुण्यरूपं करुणाकरन्तं श्रीरामचन्द्रं शरणं प्रपद्ये ॥३२॥\n\n"
                  "मनोजवं मारुततुल्यवेगं जितेन्द्रियं बुद्धिमतां वरिष्ठम् ।\n"
                  "वातात्मजं वानरयूथमुख्यं श्रीरामदूतं शरणं प्रपद्ये ॥३३॥\n\n"
                  "श्री राम रामेति रामेति रमे रामे मनोरमे ।\n"
                  "सहस्रनाम तत्तुल्यं रामनाम वरानने ॥३८॥\n\n"
                  "श्री राम रामेति रामेति रमे रामे मनोरमे ।\n"
                  "सहस्रनाम तत्तुल्यं रामनाम वरानने ॥३८॥",
                ),

                _buildSectionTitle("॥ ॐ श्रीपरमात्मने नमः ॥"),

                _buildSectionContents("प्रनवउँ पवनकुमार खल बन पावक ग्यानघन ।\n"
                    "जासु हृदय आगार बसहिं राम सर चाप धर ॥\n"),

                _buildSectionTitle("किष्किन्धाकाण्ड"),

                _buildSectionContents("दोहा 29 : "
                    "बलि बाँधत प्रभु बाढ़ेउ सो तनु बरनि न जाइ।\n"
                    "उभय घरी महँ दीन्हीं सात प्रदच्छिन धाइ ॥"),

                _buildSectionContents("चौपाई"
                    "अंगद कहइ जाउँ मैं पारा ।\n जियँ संसय कछु फिरती बारा ॥\n"
                    "जामवंत कह तुम्ह सब लायक ।\n पठइअ किमि सबही कर नायक ॥\n"
                    "कहइ रीछपति सुनु हनुमाना ।\n का चुप साधि रहेहु बलवाना ॥\n"
                    "पवन तनय बल पवन समाना ।\n बुधि बिबेक बिग्यान निधाना ॥\n"
                    "कवन सो काज कठिन जग माहीं ।\n जो नहिं होइ तात तुम्ह पाहीं ॥\n"
                    "राम काज लगि तव अवतारा ।\n सुनतहिं भयउ पर्बताकारा ॥\n"
                    "कनक बरन तन तेज बिराजा ।\n मानहुँ अपर गिरिन्ह कर राजा ॥\n"
                    "सिंहनाद करि बारहिं बारा ।\n लीलहिं नाघउँ जलनिधि खारा ॥\n"
                    "सहित सहाय रावनहि मारी।\n आनउँ इहाँ त्रिकूट उपारी ॥\n"
                    "जामवंत मैं पूँछउँ तोही ।\n उचित सिखावनु दीजहु मोही ॥\n"
                    "एतना करहु तात तुम्ह जाई ।\n सीतहि देखि कहहु सुधि आई ॥\n"
                    "तब निज भुज बल राजिवनैना ।\n कौतुक लागि संग कपि सेना ॥"),
                const SizedBox(height: 20), // Add some space between sections

                _buildSectionContents("छंद"
                    "कपि सेन संग सँघारि निसिचर राम सीतहि आनिहैं।\n"
                    "त्रैलोक पावन सुजसु सुर मुनि नारदादि बखानिहैं |\n"
                    "जो सुनत गावत कहत समुझत परम पद र पावई |\n"
                    "रघुबीर पद पाथोज मधुकर दास तुलसी गावई ॥"),
                const SizedBox(height: 20), // Add some space between sections

                _buildSectionContents("दोहा 30 : "
                    "भव भेषज रघुनाथ जसु सुनहिं जे नर अरु नारि ।\n"
                    "तिन्ह कर सकल मनोरथ सिद्ध करहिं त्रिसिरारि ॥"),
                const SizedBox(height: 20), // Add some space between sections

                _buildSectionContents("सोरठा 30 (ख) : "
                    "नीलोत्पल तन स्याम काम कोटि सोभा अधिक ।\n"
                    "सुनितासु गुन ग्राम जासु नाम अघ खग बधिक ॥"),

                Center(
                  child: _buildSectionTitles(
                      "॥ श्रीगणेशाय नमः ॥ \nश्रीजानकीवल्लभो विजयते\n"
                      "श्रीरामचरितमानस\n"
                      "पञ्चम सोपान"),
                ),
                _buildSectionTitle("सुन्दरकाण्ड"),

                _buildSectionContents("श्लोक : "
                    "शान्तं शाश्वतमप्रमेयमनघं निर्वाणशान्तिप्रदं \n"
                    "ब्रह्माशम्भुफणीन्द्रसेव्यमनिशं वेदान्तवेद्यं विभुम् ।\n"
                    "रामाख्यं जगदीश्वरं सुरगुरुं मायामनुष्यं हरिं \n"
                    "वन्देऽहं करुणाकरं रघुवरं भूपालचूडामणिम् ॥ १ ॥"),

                _buildSectionContents(""
                    "नान्या स्पृहा रघुपते हृदयेऽस्मदीये\n"
                    "सत्यं वदामि च भवानखिलान्तरात्मा ।\n"
                    "भक्तिं प्रयच्छ रघुपुङ्गव निर्भरां मे \n"
                    "कामादिदोषरहितं कुरु मानसं च ॥ २ ॥"),

                _buildSectionContents(""
                    "अतुलितबलधामं हेमशैलाभदेहं \n"
                    "दनुजवनकृशानुं ज्ञानिनामग्रगण्यम् ।\n"
                    "सकलगुणनिधानं वानराणामधीशं\n"
                    "रघुपतिप्रियभक्तं वातजातं नमामि ॥ ३ ॥"),

                _buildSectionContents("चौपाई : "
                    "जामवंत के बचन सुहाए। \n"
                    "सुनि हनुमंत हृदय अति भाए ।।\n"
                    "तब लगि मोहि परिखेहु तुम्ह भाई । \n"
                    "सहि दुख कंद मूल फल खाई ।।\n"
                    "जब लगि आवौं सीतहि देखी। \n"
                    "होइहि काजु मोहि हरष बिसेषी।।\n"
                    "यह कहि नाइ सबन्हि कहुँ माथा । \n"
                    "चलेउ हरषि हियँ धरि रघुनाथा ।।"),

                _buildSectionContents("सिंधु तीर एक भूधर सुंदर । \n"
                    "कौतुक कूदि चढ़ेउता ऊपर ।।\n"
                    "बार बार रघुबीर सँभारी । \n"
                    "तरकेउ पवनतनय बल भारी ।।\n"
                    "जेहिं गिरि चरन देइ हनुमंता । \n"
                    "चलेउ सो गा पाताल तुरंता ।।\n"
                    "जिमि अमोघ रघुपति कर बाना । \n"
                    "एही भाँति चलेउ हनुमाना ।।\n"
                    "जलनिधि रघुपति दूत बिचारी । \n"
                    "तैं मैनाक होहि श्रमहारी ।।"),

                _buildSectionContents("दोहा १ : "
                    "हनूमान तेहि परसा कर पुनि कीन्ह प्रनाम । \n"
                    "राम काजु कीन्हें बिनु मोहि कहाँ विश्राम।।"),

                _buildSectionContents("चौपाई : "
                    "जात पवनसुत देवन्ह देखा ।\n"
                    "जानें कहुँ बल बुद्धि बिसेषा ।।\n"
                    "सुरसा नाम अहिन्ह के माता। \n"
                    "पठइन्हि आइ कही तेहि बाता ।।\n"
                    "आजु सुरन्ह मोहि दीन्ह अहारा।\n"
                    "सुनत बचन कह पवनकुमारा ।।\n"
                    "राम काजु करि फिरि मैं आयीं। \n"
                    "सीता कइ सुधि प्रभुहि सुनावीं । ।\n"
                    "तब तव बदन पैठिहउँ आई। \n"
                    "सत्य कहउँ मोहि जान दे माई ।।\n"
                    "कबहुँ जतन देह नहिं जाना। \n"
                    "प्रससि न मोहि कहेउ हनुमाना ।।\n"
                    "जोजन भरि तेहिं बदनु पसारा ।\n"
                    "कपि तनु कीन्ह दुगुन विस्तारा ।।\n"
                    "सोरह जोजन मुख तेहिं व्यऊ।\n"
                    "तुरत पवनसुत बत्तिस भयऊ ।।\n"
                    "जस जस सुरसा बदनु बढ़ावा ।\n"
                    "तासु दून कपि रूप देखावा ।।\n"
                    "सत जोजन तेहिं आनन कीन्हा ।\n"
                    "अति लघु रूप पवनसुत लीन्हा ।।\n"
                    "बदन पइठि पुनि बाहेर आवा। \n"
                    "मागा बिदा ताहि सिरु नावा ।।\n"
                    "मोहि सुरन्ह जेहि लागि पठावा। \n"
                    "बुधि बल मरमु तोर मै पावा ।।"),

                _buildSectionContents("दोहा २ : "
                    "राम काजु सबु करिहतु तुम्ह बल बुद्धि निधान ।\n"
                    "आसिष देह गई सो हरषि चलेउ हनुमान।।"),

                _buildSectionContents("चौपाई : "
                    "निसिचरि एक सिंधु महुँ रहई।\n"
                    "करि माया नभु के खग गहई ।।\n"
                    "जीव जंतु जे गगन उड़ाहीं ।\n"
                    "जल बिलोकि तिन्ह के परिछाहीं ।।\n"
                    "गहइ छा सक सो न उड़ाई।\n"
                    "एहि बिधि सदा गगनचर खाई ।।\n"
                    "सोइ छल हनूमान कहँ कीन्हा ।\n"
                    "तासु कपटु कपि तुरतहिं चीन्हा ।।\n"
                    "ताहि मारि मारुतसुत बीरा।\n"
                    "बारिधि पार गयउ मतिधीरा ।।\n"
                    "तहाँ जाइ देखी बन सोभा ।\n"
                    "गुंजत चंचरीक मधु लोभा ।।\n"
                    "नाना तरु फल फूल सुहाए।\n"
                    "खग मृग बूंद देखि मन भाए ।।\n"
                    "सैल बिसाल देखि एक आगें ।\n"
                    "ता पर धाड़ चढेउ भय त्यागें ।।\n"
                    "उमा न कछु कपि के अधिकाई ।\n"
                    "प्रभु प्रताप जो कालहि खाई ।।\n"
                    "गिरि पर चढि लंका तेहिं देखी।\n "
                    "कहि न जाइ अति दुर्ग विसेषी।\n"
                    "अति उतंग जलनिधि चहु पासा ।\n"
                    "कनक कोट कर परम प्रकासा ।।"),

                _buildSectionContents("छंद : "
                    "कनक कोट विचित्र मनि कृत सुंदरायतना घना ।\n"
                    "चउहट्ट हट्ट सुबट्ट बीथीं चारु पुर बहु विधि बना।।\n"
                    "गज बाजि खच्चर निकर पदचर रथ बरूथिन्ह को गनै ।।\n"
                    "बहुरूप निसिचर जूथ अतिबल सेन बरनत नहिं बनै ।। १ ।।\n"
                    "बन बाग उपवन बाटिका सर कूप वापीं सोहहीं।\n"
                    "नर नाग सुर गंधर्व कन्या रूप मुनि मन मोहहीं ।।\n"
                    "कहूँ माल देह बिसाल सैल समान अतिबल गर्जहीं।\n"
                    "नाना अखारेन्ह भिरहिं बहुविधि एक एकन्ह तर्जहीं।। २ ।।\n"
                    "करि जतन भट कोटिन्ह विकट तन नगर चहुँ दिसि रच्छहीं।\n"
                    "कहुँ महिष मानषु धेनु खर अज खल निसाचर भच्छहीं।।\n"
                    "एहि लागि तुलसीदास इन्ह की कथा कछु एक है कही।\n"
                    "रघुबीर सर तीरथ सरीरन्हि त्यागि गति पैहहिं सही ।। ३ ।।"),

                _buildSectionContents("दोहा ३ : "
                    "पुर रखवारे देखि बहु कपि मन कीन्ह विचार ।\n"
                    "अति लघु रूप धरौं निसि नगर करौं पसार ।।"),

                _buildSectionContents("चौपाई : "
                    "मसक समान रूप कपि धरी ।\n"
                    "लंकहि चलेउ सुमिरि नरहरी । ।\n"
                    "नाम लंकिनी एक निसिचरी ।\n"
                    "सो कह चलेसि मोहि निंदरी ।।\n"
                    "जानेहि नहीं मरमु सठ मोरा ।\n"
                    "मोर अहार जहाँ लगि चोरा।।\n"
                    "मुठिका एक महा कपि हनी ।\n"
                    "रुधिर बमत धरनीं ढनमनी ।।\n"
                    "पुनि संभारि उठि सो लंका ।\n"
                    "जोरि पानि कर बिनय संसका।।\n"
                    "जब रावनहि ब्रह्म बर दीन्हा।\n"
                    "चलत बिरंचि कहा मोहि चीन्हा।।\n"
                    "बिकल होसि तें कपि के मारे। \n"
                    "तब जानेसु निसिचर संघारे ।।\n"
                    "तात मोर अति पुन्य बहूता ।\n"
                    "देखेउँ नयन राम कर दूता ।।"),

                _buildSectionContents("दोहा ४ : "
                    "तात स्वर्ग अपवर्ग सुख धरिअ तुला एक अंग ।\n"
                    "तूल न ताहि सकल मिलि जो सुख लव सतसंग ।।"),

                _buildSectionContents("चौपाई : "
                    "प्रबिसि नगर कीजे सब काजा।\n"
                    "हृदयँ राखि कीसलपुर राजा ।।\n"
                    "गरल सुधा रिपु करहिं मिताई।\n"
                    "गोपद सिंधु अनल सितलाई ।।\n"
                    "गरुड़ सुमेरु रेनू सम ताही ।\n"
                    "राम कृपा करि चितवा जाही।।\n"
                    "अति लघु रूप धरेउ हनुमाना ।\n"
                    "पैठा नगर सुमिरि भगवाना।।\n"
                    "मंदिर मंदिर प्रति करि सोधा ।\n"
                    "देखे जहँ तहँ अगनित जोधा ।।\n"
                    "गयउ दसानन मंदिर माहीं।\n"
                    "अति विचित्र कहि जात सो नाहीं।।\n"
                    "सयन किए देखा कपि तेही ।\n"
                    "मंदिर महुँ न दीखि बैदेही ।।\n"
                    "भवन एक पुनि दीख सुहावा ।\n"
                    "हरि मंदिर त भिन्न बनावा ।।"),

                _buildSectionContents("दोहा ५ : "
                    "रामायुध अंकित गृह सोभा बरनि न जाइ ।\n"
                    "नव तुलसिका वृंद तह देखि हरषि कपिराह ।।"),

                _buildSectionContents("चौपाई : "
                    "लंका निसिचर निकर निवासा ।\n"
                    "इहाँ कहाँ सज्जन कर बासा।।\n"
                    "मन महुँ तरक करे कपि लागा।\n"
                    "तेही समय बिभीषनु जागा ।।\n"
                    "राम राम तेहिं सुमिरन कीन्हा ।\n"
                    "हृदयँ हरष कपि सज्जन चीन्हा ।।\n"
                    "एहि सन हठि करिहउँ पहिचानी ।\n"
                    "साधु ते होइ न कारज हानी ।।\n"
                    "बिप्र रुप धरि बचन सुनाए ।\n"
                    "सुनत बिभीषण उठि त आए ।।\n"
                    "करि प्रनाम पूँछी कुसलाई ।\n"
                    "बिप्र कहहु निज कथा बुझाई ।।\n"
                    "की तुम्ह हरि दासह महँ कोई ।\n"
                    "मोरें हृदय प्रीति अति होई ।।\n"
                    "की तुम्ह रामु दीन अनुरागी ।\n"
                    "आयहु मोहि करन बड़भागी।।"),

                _buildSectionContents("दोहा ६ : "
                    "तब हनुमंत कही सब राम कथा निज नाम ।\n"
                    "सुनत जुगल तन पुलक मन मगन सुमिरि गुन ग्राम।।"),

                _buildSectionContents("चौपाई : "
                    "सुनहु पवनसुत रहनि हमारी।\n"
                    "जिमि दसनन्हि महुँ जीभ बिचारी ।।\n"
                    "तात कबहुँ मोहि जानि अनाथा ।\n"
                    "करिहहिं कृपा भानुकुल नाथा ।।\n"
                    "तामस तनु कछु साधन नाहीं ।\n"
                    "प्रीति न पद सरोज मन माहीं।।\n"
                    "अब मोहि भा भरोस हनुमंता ।\n"
                    "बिनु हरिकृपा मिलहिं नहिं संता ।।\n"
                    "जी रघुबीर अनुग्रह कीन्हा ।\n"
                    "ती तुम्ह मोहि दरसु हठि दीन्हा ।।\n"
                    "सुनहु बिभीषन प्रभु के रीती।\n"
                    "करहिं सदा सेवक पर प्रीती ।।\n"
                    "कहहु कवन मैं परम कुलीना ।\n"
                    "कपि चंचल सबहीं बिधि हीना ।।\n"
                    "प्रात लेड़ जो नाम हमारा।\n"
                    "तेहि दिन ताहि न मिले अहारा ।।"),

                _buildSectionContents("दोहा ७ : "
                    "अस मैं अधम सखा सुनु मोहू पर रघुबीर ।\n"
                    "कीन्ही कृपा सुमिरि गुन भरे बिलोचन नीर ।।"),

                _buildSectionContents("चौपाई : "
                    "जानत अस स्वामि बिसारी।\n"
                    "फिरहिं ते काहे न होहिं दुखारी ।।\n"
                    "एहि बिधि कहत राम गुन ग्रामा।\n"
                    "पावा अनिर्वाच्य बिश्रामा ।।\n"
                    "पुनि सब कथा बिभीषन कही।\n"
                    "जेहि बिधि जनकसुता तहँ रही ।।\n"
                    "तब हनुमंत कहा सुनु भ्राता ।\n"
                    "देखी चहउँ जानकी माता ।।\n"
                    "जुगुति बिभीषन सकल सुनाई।\n"
                    "चलेउ पवनसुत बिदा कराई ।।\n"
                    "करि सोड़ रूप गयउ पुनि तहवाँ ।\n"
                    "बन असोक सीता रह जहवाँ ।।\n"
                    "देखि मनहि महुँ कीन्ह प्रनामा ।\n"
                    "बैठेहिं बीति जात निसि जामा ।।\n"
                    "कृस तन सीस जटा एक बेनी।\n"
                    "जपति हृदयँ रघुपति गुन श्रेनी ।।"),

                _buildSectionContents("दोहा ८ : "
                    "निज पद नयन दिएँ मन राम पद कमल लीन।\n"
                    "परम दुखी भा पवनसुत देखि जानकी दीन ।।"),

                _buildSectionContents("चौपाई : "
                    "तरु पल्लव महुँ रहा लुकाई ।\n"
                    "करइ बिचार करों का भाई ।।\n"
                    "तेहि अवसर रावनु त आवा।\n"
                    "संग नारि बहु किए बनावा ।। "
                    "बहु बिधि खल सीतहि समुझावा ।\n"
                    "साम दान भय भेद देखावा ।।\n"
                    "कह रावनु सुनु सुमुखि सयानी।\n"
                    "मंदोदरी आदि सब रानी ।।\n"
                    "तव अनुचरी कर पन मोरा ।\n"
                    "एक बार बिलोकु मम ओरा ।।\n"
                    "तृन धरि ओट कहति बैदेही।\n"
                    "सुमिरि अवधपति परम सनेही ।।\n"
                    "सुनु दसमुख खद्योत प्रकासा ।\n"
                    "कबहुँ कि नलिनी करइ बिकासा ।।\n"
                    "अस मन समुझु कहति जानकी।\n"
                    "खल सुधि नहिं रघुबीर बान की ।।\n"
                    "सठ सूने हरि आनेहि मोहि ।\n"
                    "अधम निलज्ज लाज नहिं तोही ।।"),

                _buildSectionContents("दोहा ९ : "
                    "आपुहि सुनि खद्योत सम रामहि भानु समान।\n"
                    "परुष वचन सुनि काढ़ि असि बोला अति खिसिआन ।।"),

                _buildSectionContents("चौपाई : "
                    "सीता तैं मम कृत अपमाना।\n"
                    "कटिहउँ तव सिर कठिन कृपाना ।।\n"
                    "नाहिं त सपदि मानु मम बानी ।\n"
                    "सुमुखि होति न त जीवन हानी ।।\n"
                    "स्याम सरोज दाम सम सुंदर ।\n"
                    "प्रभु भुज करि कर सम दसकंधर ।।\n"
                    "सो भुज कंठ कि तव असि घोरा ।\n"
                    "सुनु सठ अस प्रवान पन मोरा ।।\n"
                    "चंद्रहास हरु मम परितापं ।\n"
                    "रघुपति बिरह अनल संजाते ।।\n"
                    "सीतल निसित बहसि बर धारा ।\n"
                    "कह सीता हरु मम दुख भारा।।\n"
                    "सुनत बचन पुनि मारन धावा ।\n"
                    "मयतनयाँ कहि नीति बुझावा ।।\n"
                    "कहेसि सकल निसिचरिन्ह बोलाई।\n"
                    "सीतहि बहु बिधि त्रासहु जाई ।।\n"
                    "मास दिवस महुँ कहा न माना।\n"
                    "तो मैं मारबि कादि कृपाना ।।"),

                _buildSectionContents("दोहा १० : "
                    "भवन गयउ दसकंधर इहाँ पिसाचिनि वृंद ।\n"
                    "सीतहि त्रास देखावहि धरहिं रूप बहु मंद।।"),

                _buildSectionContents("चौपाई : "
                    "त्रिजटा नाम राच्छसी एका।\n"
                    "राम चरन रति निपुन बिबेका ।।\n"
                    "सबन्ही बोलि सुनाएसि सपना।\n"
                    "सीतहि सेइ करहु हित अपना ।।\n"
                    "सपनें बानर लंका जारी।\n"
                    "जातुधान सेना सब मारी ।।\n"
                    "वर आरूढ़ नगन दससीसा।\n"
                    "मुंडित सिर खंडित भुज बीसा ।।\n"
                    "एहि बिधि सो दच्छिन दिसि जाई ।\n"
                    "लंका मनहुँ बिभीषन पाई ।।\n"
                    "नगर फिरी रघुबीर दोहाई ।\n"
                    "तब प्रभु सीता बोलि पठाई ।।\n"
                    "यह सपना में कहउँ पुकारी।\n"
                    "होइहि सत्य गर्दै दिन चारी ।।\n"
                    "तासु बचन सुनि ते सब डरीं ।\n"
                    "जनकसुता के चरनन्हि परीं ।।"),

                _buildSectionContents("दोहा ११ : "
                    "जहँ तहँ गई सकल तब सीता कर मन सोच ।\n"
                    "मास दिवस बीतें मोहि मारिहि निसिचर पोच ।।"),

                _buildSectionContents("चौपाई : "
                    "त्रिजटा सन बोली कर जोरी।\n"
                    "मातु बिपति संगिनि तैं मोरी ।।\n"
                    "तजी देह करु बेगि उपाई।\n"
                    "दुसहु बिरहु अब नहिं सहि जाई ।।\n"
                    "आनि काठ रचु चिता बनाई ।\n"
                    "मातु अनल पुनि देहि लगाई ।।\n"
                    "सत्य करहि मम प्रीति सयानी ।\n"
                    "सुनै को श्रवन सूल सम बानी ।।\n"
                    "सुनत बचन पद गहि समुझाएसि ।\n"
                    "प्रभु प्रताप बल सुजसु सुनाएसि ।।\n"
                    "निसि न अनल मिल सुनु सुकुमारी ।\n"
                    "अस कहि सो निज भवन सिधारी ।।\n"
                    "कह सीता बिधि भा प्रतिकूला ।\n"
                    "मिलहि न पावक मिटिहि न सूला।।\n"
                    "देखिअत प्रगट गगन अंगारा ।\n"
                    "अवनि न आवत एकउ तारा।।\n"
                    "पावकमय ससि स्त्रवत न आगी।\n"
                    "मानहुँ मोहि जानि हतभागी ।।\n"
                    "सुनहि बिनय मम विटप असोका ।\n"
                    "सत्य नाम करु हरु मम सोका ।।\n"
                    "नूतन किसलय अनल समाना ।\n"
                    "देहि अगिनि जनि करहि निदाना ।।\n"
                    "देखि परम बिरहाकुल सीता ।\n"
                    "सो छन कपिहि कलप सम बीता ।।"),

                _buildSectionContents("सोरठा १२ : "
                    "कपि करि हृदय विचार दीन्हि मुद्रिका डारी तब।\n"
                    "जनु असोक अंगार दीन्हि हरषि उठि कर गहेउ ।।\n"),

                _buildSectionContents("चौपाई : "
                    "तब देखी मुद्रिका मनोहर ।\n"
                    "राम नाम अंकित अति सुंदर ।।\n"
                    "चकित चितव मुदरी पहिचानी ।\n"
                    "हरष विषाद हृदयँ अकुलानी ।।\n"
                    "जीति को सकड़ अजय रघुराई।\n"
                    "माया तें असि रचि नहिं जाई ।।\n"
                    "सीता मन विचार कर नाना।\n"
                    "मधुर वचन बोलेउ हनुमाना ।।\n"
                    "रामचंद्र गुन बरनें लागा।\n"
                    "सुनतहिं सीता कर दुख भागा ।।\n"
                    "लागीं सुनें श्रवन मन लाई ।\n"
                    "आदिहु तें सब कथा सुनाई ।।\n"
                    "श्रवनामृत जेहिं कथा सुहाई ।\n"
                    "कहि सो प्रगट होति किन भाई ।।\n"
                    "तब हनुमंत निकट चलि गयऊ।\n"
                    "फिर बैठीं मन बिसमय भयऊ ।।\n"
                    "राम दूत मैं मात ु जानकी।\n"
                    "सत्य सपथ करुनानिधान की ।।\n"
                    "यह मुद्रिका मातृ मैं आनी ।\n"
                    "दीन्हि राम तुम्ह कहँ सहिदानी ।।\n"
                    "नर बानरहि संग कहु कैसें ।\n"
                    "कहि कथा भइ संगति जैसें ।।"),

                _buildSectionContents("दोहा १३ : "
                    "कपि के बचन सप्रेम सुनि उपजा मन बिस्वास ।\n"
                    "जाना मन क्रम बचन यह कृपासिंधु कर दास ।।"),

                _buildSectionContents("चौपाई : "
                    "हरिजन जानि प्रीति अति गाढ़ी ।\n"
                    "सजल नयन पुलकावलि बाढ़ी ।।\n"
                    "बूड़त बिरह जलधि हनुमाना ।\n"
                    "भयउ तात मों कहुँ जलजाना ।।\n"
                    "अब कहु कुसल जाउँ बलिहारी ।\n"
                    "अनुज सहित सुख भवन खरारी ।।\n"
                    "कोमलचित कृपाल रघुराई ।\n"
                    "कपि केहि हेतु धरी निठुराई ।।\n"
                    "सहज बानि सेवक सुखदायक।\n"
                    "कबहुँक सुरति करत रघुनायक ।।\n"
                    "कबहुँ नयन मम सीतल ताता।\n"
                    "होइहहि निरखि स्याम मृदु गाता ।।\n"
                    "बचनु न आव नयन भरे बारी।\n"
                    "अहह नाथ ही निपट बिसारी ।।\n"
                    "देखि परम बिरहाकुल सीता ।\n"
                    "बोला कपि मृदु बचन बिनीता ।।\n"
                    "मातु कुसल प्रभु अनुज समेता ।\n"
                    "तव दुख दुखी सुकृपा निकेता ।।\n"
                    "जनि जननी मानहु जियँ ऊना।\n"
                    "तुम्ह ते प्रेमु राम के दूना ।।"),

                _buildSectionContents("दोहा १४ : "
                    "रघुपति कर संदेसु अब सुनु जननी धरि धीर ।\n"
                    "अस कहि कपि गद गद भयउ भरे बिलोचन नीर ।।"),

                _buildSectionContents("चौपाई : "
                    "कहेउ राम बियोग तव सीता ।\n"
                    "मो कहूँ सकल भए बिपरीता ।।\n"
                    "नव तरु किसलय मनहुँ कृसानू ।\n"
                    "कालनिसा सम निसि ससि भानू ।।\n"
                    "कुबलय बिपिन कुंत बन सरिसा ।\n"
                    "बारिद तपत तेल जनु बरिसा ।।\n"
                    "जे हित रहे करत तेइ पीरा।\n"
                    "उरग स्वास सम त्रिबिध समीरा ।।\n"
                    "कहू तें कछु दुख घटि होई।\n"
                    "काहि कहीं यह जान न कोई ।।\n"
                    "तत्व प्रेम कर मम अरु तोरा ।\n"
                    "जानत प्रिया एकु मनु मोरा ।।\n"
                    "सो मनु सदा रहत तोहि पाहीं ।\n"
                    "जानु प्रीति रसु एतेनहि माहीं।।\n"
                    "प्रभु संदेसु सुनत वैदेही।\n"
                    "मगन प्रेम तन सुधि नहिं तेही ।।\n"
                    "कह कपि हृदयँ धीर धरु माता ।\n"
                    "सुमिरु राम सेवक सुखदाता ।।\n"
                    "उर आनहु रघुपति प्रभुताई ।\n"
                    "सुनि मम बचन तजहु कदराई ।।"),

                _buildSectionContents("दोहा १५ : "
                    "निसिचर निकर पतंग सम रघुपति बान कृसानु ।\n"
                    "जननी हृदयँ धीर धरू जरे निसाचर जानु।।"),

                _buildSectionContents("चौपाई : "
                    "जी रघुबीर होति सुधि पाई।\n"
                    "करते नहिं बिलंबु रघुराई ।।\n"
                    "रामबान रबि उएँ जानकी।\n"
                    "तम बरुथ कहँ जातुधान की ।।\n"
                    "अबहिं मातु मैं जाउँ लवाई।\n"
                    "प्रभु आयसु नहिं राम दोहाई ।।\n"
                    "कछुक दिवस जननी धरु धीरा।\n"
                    "कपिन्ह सहित अइहहिं रघुबीरा।।\n"
                    "निसिचर मारि तोहि ले जेहहिं ।\n"
                    "तिहुँ पुर नारदादि जसु गैहहिं ।।\n"
                    "हैं सुत कपि सब तुम्हहि समाना।\n"
                    "जातुधान अति भट बलवाना ।।\n"
                    "मोरें हृदय परम संदेहा।\n"
                    "सुनि कपि प्रगट कीन्ह निज देहा ।।\n"
                    "कनक भूधराकार सरीरा।\n"
                    "समर भयंकर अतिबल बीरा।।\n"
                    "सीता मन भरोस तब भयऊ।\n"
                    "पुनि लघु रूप पवनसुत लयऊ ।।"),

                _buildSectionContents("दोहा १६ : "
                    "सुनु माता साखामृग नहिं बल बुद्धि बिसाल ।\n"
                    "प्रभु प्रताप तें गरुड़हि खाह परम लघु ब्याल ।।"),

                _buildSectionContents("चौपाई : "
                    "मन संतोष सुनत कपि बानी ।\n"
                    "भगति प्रताप तेज बल सानी ।।\n"
                    "आसिष दीन्हि रामप्रिय जाना।\n"
                    "होहु तात बल सील निधाना।।\n"
                    "अजर अमर गुननिधि सुत होहू ।\n"
                    "करहुँ बहुत रघुनायक छोहू ।।\n"
                    "करहुँ कृपा प्रभु अस सुनि काना ।\n"
                    "निर्भर प्रेम मगन हनुमाना ।।\n"
                    "बार बार नाएसि पद सीसा।\n"
                    "बोला बचन जोरि कर कीसा ।।\n"
                    "अब कृतकृत्य भयउ मैं माता ।\n"
                    "आसिष तव अमोघ विख्याता ।।\n"
                    "सुनहु मातु मोहि अतिसय भूखा ।\n"
                    "लागि देखि सुंदर फल रूखा ।।\n"
                    "सुनु सुत करहिं बिपिन रखवारी ।\n"
                    "परम सुभट रजनीचर भारी ।।\n"
                    "तिन्ह कर भय माता मोहि नाहीं ।\n"
                    "जीं तुम्ह सुख मानहु मन माहीं ।।"),

                _buildSectionContents("दोहा १७ : "
                    "देखि बुद्धि बल निपुन कपि कहेउ जानकीं जातु ।\n"
                    "रघुपति चरन हृदयँ धरि तात मधुर फल खातु ।।"),

                _buildSectionContents("चौपाई : "
                    "चलेउ नाइ सिरु पैठेड बागा ।\n"
                    "फल खाएसि तरु तौरें लागा ।।\n"
                    "रहे तहाँ बहु भट रखवारे ।\n"
                    "कछु मारेसि कछु जाइ पुकारे ।।\n"
                    "नाथ एक आवा कपि भारी ।\n"
                    "तेहिं असोक बाटिका उजारी ।।\n"
                    "खाएसि फल अरु बिटप उपारे ।\n"
                    "रच्छक मर्दि मर्दि महि डारे ।।\n"
                    "सुनि रावन पठए भट नाना ।\n"
                    "तिन्हहि देखि गर्जेठ हनुमाना ।।\n"
                    "सब रजनीचर कपि संघारे ।\n"
                    "गए पुकारत कछु अधमारे ।।\n"
                    "पुनि पठयउ तेहिं अच्छकुमारा ।\n"
                    "चला संग ले सुभट अपारा।।\n"
                    "आवत देखि बिटप गहि तर्जा ।\n"
                    "ताहि निपाति महाधुनि गर्जा ।।"),

                _buildSectionContents("दोहा १८ : "
                    "कछु मारेसि कछु मर्देसि कछु मिलएसि धरि धूरि ।\n"
                    "कछु पुनि जाह पुकारे प्रभु मर्कट बल भूरि ।।"),

                _buildSectionContents("चौपाई : "
                    "सुनि सुत बध लंकेस रिसाना ।\n"
                    "पठएसि मेघनाद बलवाना।।\n"
                    "मारसि जनि सुत बांधेसु ताही ।\n"
                    "देखिअ कपिहि कहाँ कर आही ।।\n"
                    "चला इंद्रजित अतुलित जोधा ।\n"
                    "बंधु निधन सुनि उपजा क्रोधा ।।\n"
                    "कपि देखा दारुन भट आवा।\n"
                    "कटकटाइ गर्जा अरु धावा ।।\n"
                    "अति बिसाल तर एक उपारा।\n"
                    "बिरथ कीन्ह लंकेस कुमारा ।।\n"
                    "रहे महाभट ताके संगा।\n"
                    "गहि गहि कपि मर्दह निज अंगा ।।\n"
                    "तिन्हहि निपाति ताहि सन बाजा ।\n"
                    "भिरे जुगल मानहुँ गजराजा ।\n"
                    "मुठिका मारि चढ़ा तरु जाई ।\n"
                    "ताहि एक छन मुरुछा आई ।।\n"
                    "उठि बहोरि कीन्हिसि बहु माया।\n"
                    "जीति न जाइ प्रभंजन जाया ।।"),

                _buildSectionContents("दोहा १९ : "
                    "ब्रह्म अस्त्र तेहिं साँधा कपि मन कीन्ह विचार ।\n"
                    "जौं न ब्रह्मसर मानउँ महिमा मिटर अपार ।।"),

                _buildSectionContents("चौपाई : "
                    "ब्रह्मबान कपि कहूँ तेहि मारा।\n"
                    "परतिहुँ बार कटकु संधारा ।।\n"
                    "तेहि देखा कपि मुरुछित भयऊ।\n"
                    "नागपास बाँधेसि ले गयऊ ।।\n"
                    "जासु नाम जपि सुनहु भवानी।\n"
                    "भव बंधन काटहिं नर ग्यानी ।।\n"
                    "तासु दूत कि बंध तरु आवा।\n"
                    "प्रभु कारज लगि कपिर्हि बँधावा ।।\n"
                    "कपि बंधन सुनि निसिचर धाए ।\n"
                    "कौतुक लागि सभाँ सब आए ।।\n"
                    "दसमुख सभा दीखि कपि जाई।\n"
                    "कहि न जाइ कछु अति प्रभुताई ।।\n"
                    "कर जोरें सुर दिसिप बिनीता ।\n"
                    "भृकुटि बिलोकत सकल सभीता ।।\n"
                    "देखि प्रताप न कपि मन संका।\n"
                    "जिमि अहिगन महुँ गरुड़ असंका।"),

                _buildSectionContents("दोहा २० : "
                    "कपिहि बिलोकि दसानन बिहसा कहि दुर्बाद ।\n"
                    "सुत बध सुरति कीन्हि पुनि उपजा हृदय विषाद ।।"),

                _buildSectionContents("चौपाई : "
                    "कह लंकेस कवन ते कीसा ।\n"
                    "केहिं के बल घालेहि बन खीसा ।।\n"
                    "की थीं श्रवन सुनेहि नहिं मोही।\n"
                    "देख अति असंक सठ तोही ।।\n"
                    "मारे निसिचर केहि अपराधा।\n"
                    "कहु सठ तोहि न प्रान कढ़ बाधा ।।\n"
                    "सुन रावन ब्रह्मांड निकाया।\n"
                    "पाइ जासु बल बिरचित माया ।।\n"
                    "जाकें बल बिरंचि हरि ईसा ।\n"
                    "पालत सृजत हरत दससीसा ।।\n"
                    "जा बल सीस धरत सहसानन ।\n"
                    "अंडकोस समेत गिरि कानन ।।\n"
                    "धरइ जो बिबिध देह सुरत्राता।\n"
                    "तुम्ह ते सठन्ह सिखावनु दाता ।।\n"
                    "हर कोदंड कठिन जेहि भेजा ।\n"
                    "तेहि समेत नृप दल मद गंजा ।।\n"
                    "स्वर दूषन त्रिसिरा अरु बाली ।\n"
                    "बधे सकल अतुलित बलसाली ।।"),

                _buildSectionContents("दोहा २१ : "
                    "जाके बल लवलेस तें जितेहु चराचर झारि ।\n"
                    "तासु दूत मैं जा करि हरि आनेतु प्रिय नारि ।।"),

                _buildSectionContents("चौपाई : "
                    "जान मैं तुम्हारि प्रभुताई।\n"
                    "सहसबाहु सन परी लराई ।।\n"
                    "समर बालि सन करि जसु पावा ।\n"
                    "सुनि कपि बचन बिहसि बिहरावा ।।\n"
                    "वाय फल प्रभु लागी भूखा ।\n"
                    "कपि सुभाव तें तोरे रुखा ।\n"
                    "सब के देह परम प्रिय स्वामी।\n"
                    "मारहिं मोहि कुमारग गामी।।\n"
                    "जिन्ह मोहि मारा ते मैं मारे।\n"
                    "तेहि पर बाँधेउ तनयँ तुम्हारे ।।\n"
                    "मोहि न कछु बाँधे कइ लाजा ।\n"
                    "कीन्ह चहउँ निज प्रभु कर काजा।\n"
                    "बिनती कर जोरि कर रावन ।\n"
                    "सुनहु मान तजि मोर सिखावन ।।\n"
                    "देखहु तुम्ह निज कुलहि बिचारी।\n"
                    "भ्रम तजि भजहु भगत भय हारी ।।\n"
                    "जाकें डर अति काल डेराई ।\n"
                    "जो सुर असुर चराचर खाई ।।\n"
                    "तासों बयरु कबहुँ नहिं कीजै ।\n"
                    "मोरे कहें जानकी दीजै ।।"),

                _buildSectionContents("दोहा २२ : "
                    "प्रनतपाल रघुनायक करुना सिंधु खरारि ।\n"
                    "गए सरन प्रभु राखिहं तव अपराध बिसारि ।।"),

                _buildSectionContents("चौपाई : "
                    "राम चरन पंकज उर धरहू ।\n"
                    "लंका अचल राज तुम्ह करहू ।।\n"
                    "रिषि पुलिस्त जसु बिमल मंयका ।\n"
                    "तेहि ससि महुँ जनि होहु कलंका ।।\n"
                    "राम नाम बिनु गिरा न सोहा। \n"
                    "देखु बिचारि त्यागि मद मोहा।।\n"
                    "बसन हीन नहिं सोह सुरारी ।\n"
                    "सब भूषणभूषित बर नारी ।।\n"
                    "राम बिमुख संपति प्रभुताई।\n"
                    "जाइ रही पाई बिनु पाई ।।\n"
                    "सजल मूल जिन्ह सरितन्ह नाहीं ।\n"
                    "बरषि गए पुनि तबहिं सुखाहीं ।।\n"
                    "सुनु दसकंठ कहउँ पन रोपी ।\n"
                    "बिमुख राम त्राता नहिं कोपी ।।\n"
                    "संकर सहस बिष्नु अज तोही ।\n"
                    "सकहिं न राखि राम कर द्रोही।।"),

                _buildSectionContents("दोहा २३ : "
                    "मोहमूल बहु सूल प्रद त्यागहू तम अभिमान ।\n"
                    "भज राम रघुनायक कृपा सिंधु भगवान ।।"),

                _buildSectionContents("चौपाई : "
                    "जदपि कहि कपि अति हित बानी ।\n"
                    "भगति बिबेक बिरति नय सानी ।।\n"
                    "बोला बिहसि महा अभिमानी ।\n"
                    "मिला हमहि कपि गुर बड़ ग्यानी ।।\n"
                    "मृत्यु निकट आई खल तोही ।\n"
                    "लागेसि अधम सिखावन मोही ।।\n"
                    "उलटा होइहि कह हनुमाना।\n"
                    "मतिभ्रम तोर प्रगट में जाना ।।\n"
                    "सुनि कपि बचन बहुत खिसिआना ।\n"
                    "बेगि न हरहुँ मूढ़ कर प्राना ।।\n"
                    "सुनत निसाचर मारन धाए।\n"
                    "सचिवन्ह सहित बिभीषनु आए ।।\n"
                    "नाइ सीस करि बिनय बहूता ।\n"
                    "नीति बिरोध न मारिअ दूता ।।\n"
                    "आन दंड कछु करिअ गोसाँई।\n"
                    "सबहीं कहा मंत्र भल भाई ।।\n"
                    "सुनत बिहसि बोला दसकंधर ।\n"
                    "अंग भंग करि पठड़अ बंदर ।।"),

                _buildSectionContents("दोहा २४ : "
                    "कपि के ममता पूँछ पर सबहि कहउँ समुझाइ ।\n"
                    "तेल बोरि पट बाँधि पुनि पावक देहु लगाइ ।।"),

                _buildSectionContents("चौपाई : "
                    "पूँछहीन बानर तहँ जाइहि ।\n"
                    "तब सठ निज नाथहि लड़ आइहि ।।\n"
                    "जिन्ह के कीन्हसि बहुत बड़ाई ।\n"
                    "देख मैं तिन्ह के प्रभुताई ।।\n"
                    "बचन सुनत कपि मन मुसुकाना ।\n"
                    "भइ सहाय सारद मैं जाना ।\n"
                    "जातुधान सुनि रावन बचना ।\n"
                    "लागे रचें मूढ़ सोइ रचना ।।\n"
                    "रहा न नगर बसन घृत तेला।\n"
                    "बाढ़ी पूँछ कीन्ह कपि खेला।\n"
                    "कौतुक कहँ आए पुरबासी ।\n"
                    "मारहिं चरन करहिं बहु हाँसी ।।\n"
                    "बाजहिं ढोल देहं सब तारी।\n"
                    "नगर फेरि पुनि पूँछ प्रजारी ।।\n"
                    "पावक जरत देखि हनुमंता ।\n"
                    "भयउ परम लघु रुप तुरंता ।।\n"
                    "निबुकि चढ़े कपि कनक अटारीं।\n"
                    "भई सभीत निसाचर नारीं ।।"),

                _buildSectionContents("दोहा २५ : "
                    "हरि प्रेरित तेहि अवसर चले मरुत उनचास।\n"
                    "अट्टहास करि गर्जा कपि बढ़ि लाग अकास।।"),

                _buildSectionContents("चौपाई : "
                    "देह बिसाल परम हरु आई।\n"
                    "मंदिर तें मंदिर चढ़ धाई ।।\n"
                    "जरह नगर भा लोग बिहाला ।\n"
                    "झपट लपट बहु कोटि कराला ।।\n"
                    "तात मातु हा सुनिअ पुकारा ।\n"
                    "एहि अवसर को हमहि उबारा।।\n"
                    "हम जो कहा यह कपि नहिं होई ।\n"
                    "बानर रूप धरें सुर कोई।।\n"
                    "साधु अवग्या कर फलु ऐसा ।\n"
                    "जरह नगर अनाथ कर जैसा ।।\n"
                    "जारा नगरु निमिष एक माहीं।\n"
                    "एक बिभीषन कर गृह नाहीं।।\n"
                    "ता कर दूत अनल जेहिं सिरिजा ।\n"
                    "जरा न सो तेहि कारन गिरिजा ।।\n"
                    "उलटि पलटि लंका सब जारी ।\n"
                    "कूदि परा पुनि सिंधु मझारी ।।"),

                _buildSectionContents("दोहा २६ : "
                    "पूँछ बुझाइ खोह श्रम धरि लघु रूप बहोरि ।\n"
                    "जनकसुता के आगे ठाढ़ भयउ कर जोरि।।"),

                _buildSectionContents("चौपाई : "
                    "मातु मोहि दीजे कछु चीन्हा ।\n"
                    "जैसें रघुनायक मोहि दीन्हा ।।\n"
                    "चूड़ामनि उतारि तब दयऊ।\n"
                    "हरष समेत पवनसुत लयऊ ।।\n"
                    "कहेहु तात अस मोर प्रनामा ।\n"
                    "सब प्रकार प्रभु पूरनकामा ।।\n"
                    "दीन दयाल बिरिदु संभारी।\n"
                    "हरहु नाथ मम संकट भारी।।\n"
                    "तात सक्रसुत कथा सुनाएहु ।\n"
                    "बान प्रताप प्रभुहि समुझाएहु ।।\n"
                    "मास दिवस महुँ नाथु न आवा।\n"
                    "ती पुनि मोहि जिअत नहिं पावा ।।\n"
                    "कहु कपि केहि बिधि राखौं प्राना।\n"
                    "तुम्हहू तात कहत अब जाना ।।\n"
                    "तोहि देखि सीतलि भइ छाती।\n"
                    "पुनि मो कहूँ सोइ दिनु सो राती ।।"),

                _buildSectionContents("दोहा २७ : "
                    "जनकसुतहि समुझाह करि बहु विधि धीरजु दीन्ह ।\n"
                    "चरन कमल सिरु नाइ कपि गवनु राम पहिं कीन्ह।।"),

                _buildSectionContents("चौपाई : "
                    "चलत महाधुनि गर्जेसि भारी ।\n"
                    "गर्भ स्त्रवहिं सुनि निसिचर नारी ।।\n"
                    "नाघि सिंधु एहि पारहि आवा।\n"
                    "सबद किलकिला कपिन्ह सुनावा।।\n"
                    "हरषे सब बिलोकि हनुमाना ।\n"
                    "नूतन जन्म कपिन्ह तब जाना ।।\n"
                    "मुख प्रसन्न तन तेज बिराजा ।\n"
                    "कीन्हेसि रामचन्द्र कर काजा ।।\n"
                    "मिले सकल अति भए सुखारी।\n"
                    "तलफत मीन पाव जिमि बारी ।।\n"
                    "चले हरषि रघुनायक पासा ।\n"
                    "पूँछत कहत नवल इतिहासा ।।\n"
                    "तब मधुबन भीतर सब आए।\n"
                    "अंगद संमत मधु फल खाए ।।"),

                _buildSectionContents("दोहा २८ : "
                    "जाइ पुकारे ते सब बन उजार जुबराज ।\n"
                    "सुनि सुग्रीव हरष कपि करि आए प्रभु काज।।"),

                _buildSectionContents("चौपाई : "
                    "जौं न होति सीता सुधि पाई।\n"
                    "मधुबन के फल सकहिं कि खाई ।।\n"
                    "एहि बिधि मन बिचार कर राजा।\n"
                    "आइ गए कपि सहित समाजा।।\n"
                    "आइ सबन्हि नावा पद सीसा।\n"
                    "मिलेउ सबन्हि अति प्रेम कपीसा ।।\n"
                    "पूँछी कुसल कुसल पद देखी।\n"
                    "राम कृपाँ भा काजु बिसेषी।।\n"
                    "नाथ काजु कीन्हेउ हनुमाना ।\n"
                    "राखे सकल कपिन्ह के प्राना ।।\n"
                    "सुनि सुग्रीव बहुरि तेहि मिलेऊ ।\n"
                    "कपिन्ह सहित रघुपति पर्हि चलेऊ ।।\n"
                    "राम कपिन्ह जब आवत देखा।\n"
                    "किए काजु मन हरष बिसेषा ।।\n"
                    "फटिक सिला बैठे दो भाई ।\n"
                    "परे सकल कपि चरनन्हि जाई ।।"),

                _buildSectionContents("दोहा २९ : "
                    "प्रीति सहित सब भेटे रघुपति करुना पुंज।\n"
                    "पूँछ कुसल नाथ अब कुसल देखि पद कंज।।"),

                _buildSectionContents("चौपाई : "
                    "जामवंत कह सुनु रघुराया ।\n"
                    "जा पर नाथ करहु तुम्ह दाया ।।\n"
                    "ताहि सदा सुभ कुसल निरंतर ।\n"
                    "सुर नर मुनि प्रसन्न ता ऊपर ।।\n"
                    "सोइ बिजई बिनई गुन सागर ।\n"
                    "तासु सुजसु त्रेलोक उजागर ।।\n"
                    "प्रभु की कृपा भयउ सबु काजू ।\n"
                    "जन्म हमार सुफल भा आजू ।।\n"
                    "नाथ पवनसुत कीन्हि जो करनी।\n"
                    "सहसहुँ मुख न जाइ सो बरनी ।।\n"
                    "पवनतनय के चरित सुहाए।\n"
                    "जामवंत रघुपतिहि सुनाए ।।\n"
                    "सुनत कृपानिधि मन अति भाए ।\n"
                    "पुनि हनुमान हरषि हियै लाए।।\n"
                    "कहहु तात केहि भाँति जानकी।\n"
                    "रहति करति रच्छा स्वप्रान की ।।"),

                _buildSectionContents("दोहा ३० : "
                    "नाम पाहरु दिवस निसि ध्यान तुम्हार कपाट ।\n"
                    "लोचन निज पद जंत्रित जाहिं प्रान केहिं बाट।।"),

                _buildSectionContents("चौपाई : "
                    "चलत मोहि चूड़ामनि दीन्ही ।\n"
                    "रघुपति हृदयँ लाइ सोइ लीन्ही ॥\n"
                    "नाथ जुगल लोचन भरि बारी।\n"
                    "बचन कहे कछु जनककुमारी ।।\n"
                    "अनुज समेत गहु प्रभु चरना ।\n"
                    "दीन बंधु प्रनतारति हरना ।।\n"
                    "मन क्रम बचन चरन अनुरागी ।\n"
                    "केहि अपराध नाथ हौं त्यागी।।\n"
                    "अवगुन एक मोर मैं माना।\n"
                    "बिछुरत प्रान न कीन्ह पयाना ।।\n"
                    "नाथ सो नयनन्हि को अपराधा ।\n"
                    "निसरत प्रान करिहिं हठि बाधा ।।\n"
                    "बिरह अगिनि तनु तूल समीरा।\n"
                    "स्वास जरइ छन माहिं सरीरा ।।\n"
                    "नयन स्त्रवहि जलु निज हित लागी ।\n"
                    "जरें न पाव देह बिरहागी।\n"
                    "सीता के अति बिपति बिसाला ।\n"
                    "बिनहिं कहें भलि दीनदयाला।।"),

                _buildSectionContents("दोहा ३१ : "
                    "निमिष निमिष करुनानिधि जाहिं कलप सम बीति ।\n"
                    "बेगि चलिय प्रभु आनिअ भुज बल खल दल जीति।।"),

                _buildSectionContents("चौपाई : "
                    "सुनि सीता दुख प्रभु सुख अयना ।\n"
                    "भरि आए जल राजिव नयना ।।\n"
                    "बचन काँय मन मम गति जाही।\n"
                    "सपनेहुँ बूझिअ बिपति कि ताही ।।\n"
                    "कह हनुमंत बिपति प्रभु सोई ।\n"
                    "जब तव सुमिरन भजन न होई।।\n"
                    "केतिक बात प्रभु जातुधान की।\n"
                    "रिपुहि जीति आनिबी जानकी ।।\n"
                    "सुनु कपि तोहि समान उपकारी।\n"
                    "नहिं को सुर नर मुनि तनुधारी ।।\n"
                    "प्रति उपकार करों का तोरा ।\n"
                    "सनमुख होइ न सकत मन मोरा ।।\n"
                    "सुनु सुत उरिन मैं नाहीं ।\n"
                    "देखे करि बिचार मन माहीं।।\n"
                    "पुनि पुनि कपिहि चितव सुरत्राता।\n"
                    "लोचन नीर पुलक अति गाता ।।"),

                _buildSectionContents("दोहा ३३ : "
                    "ता कर्तुं प्रभु कछु अगम नहिं जा पर तुम्ह अनुकुल |\n"
                    "तव प्रभावै बड़वानलहिं जारि सकइ खलु तूल।।"),

                _buildSectionContents("चौपाई : "
                    "नाथ भगति अति सुखदायनी ।\n"
                    "देहु कृपा करि अनपायनी ।।\n"
                    "सुनि प्रभु परम सरल कपि बानी।\n"
                    "एवमस्तु तब कहेउ भवानी।।\n"
                    "उमा राम सुभाउ जेहिं जाना ।\n"
                    "ताहि भजनु तजि भाव न आना ।।\n"
                    "यह संवाद जासु उर आवा।\n"
                    "रघुपति चरन भगति सोइ पावा ।।\n"
                    "सुनि प्रभु बचन कहहिं कपिवृंदा ।\n"
                    "जय जय जय कृपाल सुखकंदा ।।\n"
                    "तब रघुपति कपिपतिहि बोलावा ।\n"
                    "कहा चलें कर करहु बनावा ।।\n"
                    "अब बिलंबु केहि कारन कीजे ।\n"
                    "तुरत कपिन्ह कहुँ आयसु दीजे ।।\n"
                    "कौतुक देखि सुमन बहु बरषी।\n"
                    "नभ तें भवन चले सुर हरषी ।।"),

                _buildSectionContents("दोहा ३४ : "
                    "कपिपति बेगि बोलाए आए जूथप जूथ |\n"
                    "नाना बरन अतुल बल बानर भालु वरूथ।।"),

                _buildSectionContents("चौपाई : "
                    "प्रभु पद पंकज नावहिं सीसा।\n"
                    "गरजहिं भालु महाबल कीसा ।।\n"
                    "देखी राम सकल कपि सेना ।\n"
                    "चितड़ कृपा करि राजिव नैना ।।\n"
                    "राम कृपा बल पाइ कपिंदा ।\n"
                    "भए पच्छजुत मनहुँ गिरिंदा ।।\n"
                    "हरषि राम तब कीन्ह पयाना ।\n"
                    "सगुन भए सुंदर सुभ नाना ।।\n"
                    "जासु सकल मंगलमय कीती ।\n"
                    "तासु पयान सगुन यह नीती ।।\n"
                    "प्रभु पयान जाना बैदेहीं।\n"
                    "फरक बाम अँग जनु कहि देहीं ।।\n"
                    "जो जो सगुन जानकिहि होई ।\n"
                    "असगुन भयउ रावनहि सोई ।।\n"
                    "चला कटकु को बरनें पारा ।\n"
                    "गर्जहि बानर भालु अपारा।।\n"
                    "नख आयुध गिरि पादपधारी ।\n"
                    "चले गगन महि इच्छाचारी ।।\n"
                    "केहरिनाद भालु कपि करहीं।\n"
                    "डगमगाहिं दिग्गज चिक्करहीं ।।"),

                _buildSectionContents("छंद : "
                    "चिक्करहिं दिग्गज डोल महि गिरि लोल सागर खरभरे ।\n"
                    "मन हरष सभ गंधर्व सुर मुनि नाग किन्नर दुख टरे ।।\n"
                    "कटकटहिं मर्कट बिकट भट बहु कोटि कोटिन्ह धावहीं।\n"
                    "जय राम प्रबल प्रताप कोसल- नाथ गुन गन गावहीं ।। 1।।\n"
                    "सहि सक न भार उदार अहिपति बार बारहिं मोहई ।\n"
                    "गह दसन पुनि पुनि कमठ पृष्ट कठोर सो किमि सोहई ।।\n"
                    "रघुबीर रुचिर प्रयान प्रस्थिति जानि परम सुहावनी ।\n"
                    "जनु कमठ खर्पर सर्पराज सो लिखत अविचल पावनी।। 2।।"),

                _buildSectionContents("दोहा ३५ : "
                    "एहि बिधि जाह कृपानिधि उतरे सागर तीर ।\n"
                    "जहँ तहँ लागे खान फल भालु बिपुल कपि बीर ।।"),

                _buildSectionContents("चौपाई : "
                    "उहाँ निसाचर रहहिं सका ।\n"
                    "जब ते जारि गयउ कपि लंका ।।\n"
                    "निज निज गृहँ सब करहिं बिचारा ।\n"
                    "नहिं निसिचर कुल केर उबारा।।\n"
                    "जासु दूत बल बरनि न जाई।\n"
                    "तेहि आएँ पुर कवन भलाई ।।\n"
                    "दूतन्हि सन सुनि पुरजन बानी ।\n"
                    "मंदोदरी अधिक अकुलानी ।।\n"
                    "रहसि जोरि कर पति पग लागी ।\n"
                    "बोली बचन नीति रस पागी।।\n"
                    "कंत करष हरि सन परिहरहू ।\n"
                    "मोर कहा अति हित हियै धरहु ।।\n"
                    "समुझत जासु दूत कड़ करनी।\n"
                    "स्त्रवहीं गर्भ रजनीचर घरनी ।।\n"
                    "तासु नारि निज सचिव बोलाई ।\n"
                    "पठवहु कंत जो चह भलाई ।।\n"
                    "तब कुल कमल बिपिन दुखदाई।\n"
                    "सीता सीत निसा सम आई ।।\n"
                    "सुनहु नाथ सीता बिनु दीन्हें।\n"
                    "हित न तुम्हार संभु अज कीन्हें ॥"),

                _buildSectionContents("दोहा ३६ : "
                    "राम बान अहि गन सरिस निकर निसाचर भेक ।\n"
                    "जब लगि ग्रसत न तब लगि जतनु करहु तजि टेक ।।"),

                _buildSectionContents("चौपाई : "
                    "श्रवन सुनी सठ ता करि बानी ।\n"
                    "बिहसा जगत बिदित अभिमानी ।।\n"
                    "सभय सुभाउ नारि कर साचा ।\n"
                    "मंगल महुँ भय मन अति काचा ।।\n"
                    "जौं आवड़ मर्कट कटकाई ।\n"
                    "जिअहिं बिचारे निसिचर खाई ।।\n"
                    "कंपहिं लोकप जाकी त्रासा।\n"
                    "तासु नारि सभीत बड़ि हासा ।।\n"
                    "अस कहि बिहसि ताहि उर लाई ।\n"
                    "चलेउ सभाँ ममता अधिकाई ।।\n"
                    "मंदोदरी हृदयँ कर चिंता ।\n"
                    "भयउ कंत पर बिधि बिपरीता ।।\n"
                    "बैठेउ सभाँ खबरि असि पाई ।\n"
                    "सिंधु पार सेना सब आई ।।\n"
                    "बूझेसि सचिव उचित मत कहहू ।\n"
                    "ते सब हँसे मष्ट करि रहहू ।।\n"
                    "जितेहु सुरासुर तब श्रम नाहीं ।\n"
                    "नर बानर केहि लेखे माही ।।"),

                _buildSectionContents("दोहा ३७ : "
                    "सचिव बैद गुर तीनि जौं प्रिय बोलहिं भय आस ।\n"
                    "राजधर्म तन तीनि कर होइ बेगिहीं नास ।।"),

                _buildSectionContents("चौपाई : "
                    "सोइ रावन कहुँ बनि सहाई ।\n"
                    "अस्तुति करहिं सुनाइ सुनाई ।।\n"
                    "अवसर जानि बिभीषनु आवा ।\n"
                    "भ्राता चरन सीसु तेहिं नावा ।।\n"
                    "सिरुनाइ बैठ निज आसन ।\n"
                    "बोला बचन पाइ अनुसासन ।।\n"
                    "कृपाल पूँछिहु मोहि बाता ।\n"
                    "मति अनुरुप कहउँ हित ताता।।\n"
                    "जो आपन चाहे कल्याना ।\n"
                    "सुजसु सुमति सुभ गति सुख नाना ।।\n"
                    "सो परनारि लिलार गोसाईं ।\n"
                    "तजउ चउथि के चंद कि नाई ।।\n"
                    "चौदह भुवन एक पति होई ।\n"
                    "भूतद्रोह तिष्टइ नहिं सोई ।।\n"
                    "गुन सागर नागर नर जोऊ।\n"
                    "अलप लोभ भल कहइ न कोऊ ।।"),

                _buildSectionContents("दोहा ३८ : "
                    "काम क्रोध मद लोभ सब नाथ नरक के पंथ ।\n"
                    "सब परिहरि रघुबीरहि भजहु भजहिं जेहि संत ।।"),

                _buildSectionContents("चौपाई : "
                    "तात राम नहिं नर भूपाला ।\n"
                    "भुवनेस्वर कालहु कर काला ।।\n"
                    "ब्रह्म अनामय अज भगवंता ।\n"
                    "ब्यापक अजित अनादि अनंता ।।\n"
                    "गोद्विज धेनु देव हितकारी ।\n"
                    "कृपासिंधु मानुष तनुधारी ।।\n"
                    "जन रंजन भंजन खल ब्राता ।\n"
                    "बेद धर्म रच्छक सुनु भ्राता ।।\n"
                    "ताहि बयरु तजि नाइअ माथा ।\n"
                    "प्रनतारति भंजन रघुनाथा ।।\n"
                    "देहु नाथ प्रभु कहुँ बैदेही ।\n"
                    "भजहु राम बिन हेतु सनेही ।।\n"
                    "सरन गएँ प्रभु ताहुन त्यागा ।\n"
                    "बिस्व द्रोह कृत अघ जेहि लागा ।।\n"
                    "जासु नाम त्रय ताप नसावन ।\n"
                    "सोइ प्रभु प्रगट समुझु जियँ रावन ।।"),

                _buildSectionContents("दोहा ३९ (क) : "
                    "बार बार पद लागउँ बिनय करउँ दससीस ।\n"
                    "परिहरि मान मोह मद भजहु कोसलाधीस ।।"),

                _buildSectionContents("चौपाई : "
                    "मुनि पुलस्ति निज सिष्य सन कहि पठई यह बात ।\n"
                    "तुरत सो मैं प्रभु सन कही पाइ सुअवसरु तात ।।\n"
                    "माल्यवंत अति सचिव सयाना ।\n"
                    "तासु बचन सुनि अति सुख माना ।।\n"
                    "तात अनुज तव नीति बिभूषन ।\n"
                    "सो उर धरहु जो कहत बिभीषन ।।\n"
                    "रिपु उतकर कहत सठ दोऊ ।\n"
                    "दूरिन करहु इहाँ हइ कोऊ ।।\n"
                    "माल्यवंत गृह गयउ बहोरी ।\n"
                    "कहइ बिभीषनु पुनि कर जोरी ।।\n"
                    "सुमति कुमति सब के उर रहहीं।\n"
                    "नाथ पुरान निगम अस कहहीं ।।\n"
                    "जहाँ सुमति तहँ संपति नाना ।\n"
                    "जहाँ कुमति तहँ बिपति निदाना ।।\n"
                    "तव उर कुमति बसी बिपरीता ।\n"
                    "हित अनहित मानहु रिपु प्रीता ।।\n"
                    "कालराति निसिचर कुल केरी।\n"
                    "तेहि सीता पर प्रीति घनेरी ।।"),

                _buildSectionContents("दोहा ४० : "
                    "तात चरन गहि मागउँ राखहु मोर दुलार ।\n"
                    "सीत देहु राम कहुँ अहित न होइ तुम्हार ।।"),

                _buildSectionContents("चौपाई : "
                    "बुध पुरान श्रुति संमत बानी ।\n"
                    "कही बिभीषन नीति बखानी ।।\n"
                    "सुनत दसानन उठा रिसाई ।\n"
                    "खल तोहि निकट मुत्यु अब आई ।।\n"
                    "जिअसि सदा सठ मोर जिआवा।\n"
                    "रिपु कर पच्छ मूढ़ तोहि भावा ।।\n"
                    "कहसि न खल अस को जग माहीं ।\n"
                    "भुज बल जाहि जिता मैं नाही ।।\n"
                    "मम पुर बसि तपसिन्ह पर प्रीती ।\n"
                    "सठ मिल जाइ तिन्हहि कहु नीती ।।\n"
                    "अस कहि कीन्हेसि चरन प्रहारा ।\n"
                    "अनुज गहे पद बारहिं बारा ।।\n"
                    "उमा संत कइ इह बड़ाई ।\n"
                    "मंद करत जो करइ भलाई ।।\n"
                    "तुम्ह पितु सरिस भलेहिं मोहि मारा।\n"
                    "रामु भजें हित नाथ तुम्हारा ।।\n"
                    "सचिव संग लै नभ पथ गयऊ ।\n"
                    "सबहि सुनाइ कहत अस भयऊ ।।"),

                _buildSectionContents("दोहा ४१ : "
                    "रामु सत्यसंकल्प प्रभु सभा कालबस तोरि।\n"
                    "रघुबीर सरन अब जाउँ देहु जनि खोरि ।।"),

                _buildSectionContents("चौपाई : "
                    "अस कहि चला बिभीषनु जबहीं ।\n"
                    "आयुहीन भए सब तबहीं ।।\n"
                    "साधु अवग्या तुरत भवानी।\n"
                    "कर कल्यान अखिल कै हानी ।।\n"
                    "रावन जबहिं बिभीषन त्यागा ।\n"
                    "भयउ बिभव बिनु तबहिं अभागा ।।\n"
                    "चलेउ हरषि रघुनायक पाहीं ।\n"
                    "करत मनोरथ बहु मन माहीं ।।\n"
                    "देखिहउँ जाइ चरन जलजाता ।\n"
                    "अरुन मृदुल सेवक सुखदाता ।।\n"
                    "जे पद परसि तरी रिषिनारी ।\n"
                    "दंडक कानन पावनकारी ।।\n"
                    "जे पद जनकसुताँ उर लाए।\n"
                    "कपट कुरंग संग धर धाए ।।\n"
                    "हर उर सर सरोज पद जेई ।\n"
                    "अहोभाग्य मै देखिहउँ तेई ।।"),

                _buildSectionContents("दोहा ४२ : "
                    "जिन्ह पायन्ह के पादुकन्हि भरतु रहे मन लाइ ।\n"
                    "ते पद आजु बिलोकिहउँ इन्ह नयनन्हि अब जाइ ।।"),

                _buildSectionContents("चौपाई : "
                    "एहि बिधि करत सप्रेम बिचारा ।\n"
                    "आयउ सपदि सिंधु एहिं पारा ।।\n"
                    "कपिन्ह बिभीषनु आवत देखा ।\n"
                    "जाना को रिपु दूत बिसेषा ।।\n"
                    "ताहि राखि कपीस पहिं आए। \n"
                    "समाचार सब ताहि सुनाए ।।\n"
                    "कह सुग्रीव सुनहु रघुराई ।\n"
                    "आवा मिलन दसानन भाई ।।\n"
                    "कह प्रभु सखा बूझिऐ काहा ।\n"
                    "कहइ कपीस सुनहु नरनाहा ।।\n"
                    "जानि न जाइ निसाचर माया ।\n"
                    "कामरूप केहि कारन आया ।।\n"
                    "भेद हमार लेन सठ आवा। \n"
                    "राखिअ बाँधि मोहि अस भावा ।।\n"
                    "सखा नीति तुम्ह नीकि बिचारी ।\n"
                    "मम पन सरनागत भयहारी ।।\n"
                    "सुनि प्रभु बचन हरष हनुमाना।\n"
                    "सरनागत बच्छल भगवाना ।।"),

                _buildSectionContents("दोहा ४३ : "
                    "सरनागत कहुँ जे तजहिं निज अनहित अनुमानि ।\n"
                    "ते नर पावर पापमय तिन्हहि बिलोकत हानि ।।"),

                _buildSectionContents("चौपाई : "
                    "कोटि बिप्र बध लागहिं जाहू ।\n"
                    "आएँ सरन तजउँ नहिं ताहू ।।\n"
                    "सनमुख होइ जीव मोहि जबहीं।\n"
                    "जन्म कोटि अघ नासहिं तबहीं ।।\n"
                    "पापवंत कर सहज सुभाऊ ।\n"
                    "भजन मोर तेहि भाव न काऊ ।।\n"
                    "पैदुष्टहदय सोइ होई ।\n"
                    "मोरें सनमुख आव कि सोई ।।\n"
                    "निर्मल मन जन सो मोहि पावा ।\n"
                    "मोहि कपट छल छिद्र न भावा ।।\n"
                    "भेद लेन पठवा दससीसा ।\n"
                    "तबहुँ न कछु भय हानि कपीसा ।।\n"
                    "जग महुँ सखा निसाचर जेते ।\n"
                    "लछिमनु हनइ निमिष महुँ तेते ।।\n"
                    "जौं सभीत आवा सरनाई।\n"
                    "रखिहउँ ताहि प्रान की नाई ।।"),

                _buildSectionContents("दोहा ४४ : "
                    "उभय भाँति तेहि आनहु हँसि कह कृपानिकेत ।\n"
                    "जय कृपाल कहि चले अंगद हनू समेत ।।"),

                _buildSectionContents("चौपाई : "
                    "सादर तेहि आगें करि बानर ।\n"
                    "चले जहाँ रघुपति करुनाकर ।।\n"
                    "दूरिहि ते देखे द्वौ भ्राता ।\n"
                    "नयनानंद दान के दाता ।।\n"
                    "बहुरि राम छबिधाम बिलोकी ।\n"
                    "रहेउ ठटुकि एकटक पल रोकी ।।\n"
                    "भुज प्रलंब कंजारुन लोचन ।\n"
                    "स्यामल गात प्रनत भय मोचन ।।\n"
                    "सिंघ कंध आयत उर सोहा ।\n"
                    "आनन अमित मदन मन मोहा।।\n"
                    "नयन नीर पुलकित अति गाता "
                    "मन धरि धीर कही मृदु बाता ।\n"
                    "नाथ दसानन कर मैं भ्राता ।\n"
                    "निसिचर बंस जनम सुरत्राता ।।\n"
                    "सहज पापप्रिय तामस देहा ।\n"
                    "जथा उलूकहि तम पर नेहा ।।"),

                _buildSectionContents("दोहा ४५ : "
                    "श्रवन सुजसु सुनि आयउँ प्रभु भंजन भव भीर ।\n"
                    "त्राहि त्राहि आरति हरन सरन सुखद रघुबीर ।।"),

                _buildSectionContents("चौपाई : "
                    "अस कहि करत दंडवत देखा।\n"
                    "तुरत उठे प्रभु हरष बिसेषा ।।\n"
                    "दीन बचन सुनि प्रभु मन भावा ।\n"
                    "भुज बिसाल गहि हृदयँ लगावा ।।\n"
                    "अनुज सहित मिलि ढिग बैठारी ।\n"
                    "बोले बचन भगत भयहारी ।।\n"
                    "कहु लंकेस सहित परिवारा।\n"
                    "कुसल कुठाहर बास तुम्हारा ।।\n"
                    "खल मंडलीं बसहु दिनु राती ।\n"
                    "सखा धरम निबहइ केहि भाँती ।।\n"
                    "मैं जान तुम्हारि सब रीती ।\n"
                    "अति नय निपुन न भाव अनीती ।।\n"
                    "बरु भल बास नरक कर ताता ।\n"
                    "दुष्ट संग जनि देह बिधाता ।।\n"
                    "अब पद देखि कुसल रघुराया ।\n"
                    "जौं तुम्ह कीन्ह जानि जन दाया ।।"),

                _buildSectionContents("दोहा ४६ : "
                    "तब लगि कुसल न जीव कहुँ सपनेहुँ मन बिश्राम |\n"
                    "जब लगि भजत न राम कहुँ सोक धाम तजि काम ।।"),

                _buildSectionContents("चौपाई : "
                    "तब लगि हृदयँ बसत खल नाना ।\n"
                    "लोभ मोह मच्छर मद माना ।।\n"
                    "जब लगि उर न बसत रघुनाथा ।\n"
                    "धरें चाप सायक कटि भाथा ।।\n"
                    "ममता तरुन तमी अँधिआरी ।\n"
                    "राग द्वेष उलूक सुखकारी ॥ \n"
                    "तब लगि बसति जीव मन माहीं ।\n"
                    "जब लगि प्रभु प्रताप रबि नाहीं ।।\n"
                    "अब मैं कुसल मिटे भय भारे ।\n"
                    "देखि राम पद कमल तुम्हारे ।।\n"
                    "तुम्ह कृपाल जा पर अनुकूला ।\n"
                    "ताहि न ब्याप त्रिबिध भव सूला ।।\n"
                    "मैं निसिचर अति अधम सुभाऊ ।\n"
                    "सुभ आचरनु कीन्ह नहिं काऊ ।।\n"
                    "जासु रूप मुनि ध्यान न आवा।\n"
                    "तेहिं प्रभु हरषि हृदयँ मोहि लावा ।।"),

                _buildSectionContents("दोहा ४७ : "
                    "अहोभाग्य मम अमित अति राम कृपा सुख पुंज ।\n"
                    "देखेउँ नयन बिरंचि सिब सेब्य जुगल पद कंज ।।"),

                _buildSectionContents("चौपाई : "
                    "सुनहु सखा निज कहउँ सुभाऊ ।\n"
                    "जान भुसुंडि संभु गिरिजाऊ ।।\n"
                    "जौं नर होइ चराचर द्रोही।\n"
                    "आवे सभय सरन तकि मोही ।। "
                    "तजि मद मोह कपट छल नाना ।\n"
                    "कर सद्य तेहि साधु समाना ।।\n"
                    "जननी जनक बंधु सुत दारा।\n"
                    "तनु धनु भवन सुहृद परिवारा ।।\n"
                    "सब के ममता ताग बटोरी।\n"
                    "मम पद मनहि बाँध बरि डोरी ।।\n"
                    "समदरसी इच्छा कछु नाहीं ।\n"
                    "हरष सोक भय नहिं मन माहीं ।।\n"
                    "अस सज्जन मम उर बस कैसें ।\n"
                    "लोभी हृदयँ बस धनु जैसें ।।\n"
                    "तुम्ह सारिखे संत प्रिय मोरें ।\n"
                    "धरउँ देह नहिं आन निहोरें ।।"),

                _buildSectionContents("दोहा ४८ : "
                    "सगुन उपासक परहित निरत नीति दृढ़ नेम ।\n"
                    "ते नर प्रान समान मम जिन्ह के द्विज पद प्रेम ।।"),

                _buildSectionContents("चौपाई : "
                    "सुनु लंकेस सकल गुन तोरें।\n"
                    "तातें तुम्ह अतिसय प्रिय मोरें ।।\n"
                    "राम बचन सुनि बानर जूथा ।\n"
                    "सकल कहहिं जय कृपा बरूथा ।।\n"
                    "सुनत बिभीषनु प्रभु के बानी ।\n"
                    "नहिं अघात श्रवनामृत जानी ।।\n"
                    "पद अंबुज गहि बारहिं बारा ।\n"
                    "हृदयँ समात न प्रेमु अपारा।।\n"
                    "सुनहु देव सचराचर स्वामी ।\n"
                    "प्रनतपाल उर अंतरजामी।।\n"
                    "उर कछु प्रथम बासना रही। \n"
                    "प्रभु पद प्रीति सरित सो बही ।।\n"
                    "अब कृपाल निज भगति पावनी। \n"
                    "देहु सदा सिव मन भावनी ।।\n"
                    "एवमस्तु कहि प्रभु रनधीरा ।\n"
                    "मागा तुरत सिंधु कर नीरा ।।\n"
                    "जदपि सखा तव इच्छा नाहीं ।\n"
                    "मोर दरसु अमोघ जग माहीं ।।\n"
                    "अस कहि राम तिलक तेहि सारा ।\n"
                    "सुमन बृष्टि नभ भई अपारा।।"),

                _buildSectionContents("दोहा ४९ (क) : "
                    "रावन क्रोध अनल निज स्वास समीर प्रचंड |\n"
                    "जरत बिभीषनु राखेउ दीन्हेहु राजु अखंड ।।"),

                _buildSectionContents("चौपाई : "
                    "जो संपति सिव रावनहि दीन्हि दिएँ दस माथ। \n"
                    "सोइ संपदा बिभीषनहि सकुचि दीन्ह रघुनाथ ।।\n"
                    "अस प्रभु छाड़ि भजहिं जे आना ।\n"
                    "ते नर पसु बिनु पूँछ बिषाना ।।\n"
                    "निज जन जानि ताहि अपनावा। \n"
                    "प्रभु सुभाव कपि कुल मन भावा ।।\n"
                    "पुनि सर्बग्य सर्ब उर बासी ।\n"
                    "सर्वरूप सब रहित उदासी ।।\n"
                    "बोले बचन नीति प्रतिपालक ।\n"
                    "कारन मनुज दनुज कुल घालक ।।\n"
                    "सुनु कपीस लंकापति बीरा।\n"
                    "केहि बिधि तरिअ जलधि गंभीरा ।।\n"
                    "संकुल मकर उरग झष जाती। \n"
                    "अति अगाध दुस्तर सब भाँती ।।\n"
                    "कह लंकेस सुनहु रघुनायक ।\n"
                    "कोटि सिंधु सोषक तव सायक।।\n"
                    "जद्यपि तदपि नीति असि गाई ।\n"
                    "बिनय करिअ सागर सन जाई ।।"),

                _buildSectionContents("दोहा ५० : "
                    "प्रभु तुम्हार कुलगुर जलधि कहिहि उपाय बिचारि |\n"
                    "बिनु प्रयास सागर तरिहि सकल भालु कपि धारि ।।"),

                _buildSectionContents("चौपाई : "
                    "सखा कही तुम्ह नीकि उपाई।\n"
                    "करिअ देव जौं होइ सहाई ।।\n"
                    "मंत्र न यह लछिमन मन भावा ।\n"
                    "रामबचन सुनि अति दुख पावा ।।\n"
                    "नाथ देव कर कवन भरोसा ।\n"
                    "सोषिअ सिंधु करिअ मन रोसा ।।\n"
                    "कादर मन कहुँ एक अधारा ।\n"
                    "दैव दैव आलसी पुकारा ।।\n"
                    "सुनत बिहसि बोले रघुबीरा ।\n"
                    "ऐसेहिं करब धरहु मन धीरा ।।\n"
                    "अस कहि प्रभु अनुजहि समुझाई।\n"
                    "सिंधु समीप गए रघुराई ।।\n"
                    "प्रथम प्रनाम कीन्ह सिरु नाई ।\n"
                    "बैठे पुनि तट दर्भ डसाई ।।\n"
                    "जबहिं बिभीषन प्रभु पहिं आए।\n"
                    "पाछें रावन दूत पठाए ।।"),

                _buildSectionContents("दोहा ५१ : "
                    "सकल चरित तिन्ह देखे धरें कपट कपि देह ।\n"
                    "प्रभु गुन हृदयँ सराहहिं सरनागत पर नेह ।।"),

                _buildSectionContents("चौपाई : "
                    "प्रगट बखानहिं राम सुभाऊ ।\n"
                    "अति सप्रेम गाबिसरि दुराऊ ।।\n"
                    "रिपु के दूत कपिन्ह तब जाने ।\n"
                    "सकल बाँधि कपीस पहिं आने ।।\n"
                    "कह सुग्रीव सुनहु सब बानर ।\n"
                    "अंग भंग कर पठवहु निसिचर ।।\n"
                    "सुनि सुग्रीव बचन कपि धाए ।\n"
                    "बाँधि कटक चहु पास फिराए ।।\n"
                    "बहु प्रकार मारन कपि लागे ।\n"
                    "दीन पुकारत तदपि न त्यागे ।।\n"
                    "जो हमार हर नासा काना ।\n"
                    "तेहि कोसलाधीस के आना ।।\n"
                    "सुनि लछिमन सब निकट बोलाए ।\n"
                    "दया लागि हँसि तुरत छोडाए ।।\n"
                    "रावन कर दीजहु यह पाती। \n"
                    "लछिमन बचन बाचु कुलघाती ।।"),

                _buildSectionContents("दोहा ५२ : "
                    "कहु मुखागर मूढ़ सन मम संदेसु उदार ।\n"
                    "सीता देइ मिलेहु न त आवा काल तुम्हार ।।"),

                _buildSectionContents("चौपाई : "
                    "तुरत नाइ लछिमन पद माथा ।\n"
                    "चले दूत बरनत गुन गाथा ।।\n"
                    "कहत राम जसु लंकाँ आए।\n"
                    "रावन चरन सीस तिन्ह नाए ।।\n"
                    "बिहसि दसानन पूँछी बाता ।\n"
                    "कहसि न सुक आपनि कुसलाता ।।\n"
                    "पुनि कहु खबरि बिभीषन केरी। \n"
                    "जाहि मृत्यु आई अति नेरी ।।\n"
                    "करत राज लंका सठ त्यागी ।\n"
                    "होइहि जब कर कीट अभागी ।।\n"
                    "पुनि कहु भालु कीस कटकाई ।\n"
                    "कठिन काल प्रेरित चलि आई ।।\n"
                    "जिन्ह के जीवन कर रखवारा।\n"
                    "भयउ मृदुल चित सिंधु बिचारा ।।\n"
                    "कहु तपसिन्ह के बात बहोरी ।\n"
                    "जिन्ह के हृदय त्रास अति मोरी ।।"),

                _buildSectionContents("दोहा ५३ : "
                    "की भइ भेंट कि फिर गए श्रवन सुजसु सुनि मोर ।\n"
                    "कहसि न रिपु दल तेज बल बहुत चकित चित तोर ।।"),

                _buildSectionContents("चौपाई : "
                    "नाथ कृपा करि पूँछेहु जैसें ।\n"
                    "मानहु कहा क्रोध तजि तैसें ।।\n"
                    "मिला जाइ जब अनुज तुम्हारा ।\n"
                    "जातहिं राम तिलक तेहि सारा ।।\n"
                    "रावन दूत हमहि सुनि काना ।\n"
                    "कपिन्ह बाँधि दीन्हे दुख नाना ।।\n"
                    "श्रवन नासिका काटै लागे ।\n"
                    "राम सपथ दीन्हे हम त्यागे ।।\n"
                    "पूँछिहु नाथ राम कटकाई ।\n"
                    "बदन कोटि सत बरनि न जाई ।।\n"
                    "नाना बरन भालु कपि धारी। \n"
                    "बिकटानन बिसाल भयकारी ।।\n"
                    "जेहिं पुर दहेउ हते सुत तोरा ।\n"
                    "सकल कपिन्ह मह ँ तेहि बलु थोरा ।।\n"
                    "अमित नाम भट कठिन कराला ।\n"
                    "अमित नाग बल बिपुल बिसाला ।।"),

                _buildSectionContents("दोहा ५४ : "
                    "द्विबिद मयंद नील नल अंगद गद बिकटासि ।\n"
                    "दधिमुख केहरि निसठ सठ जामवंत बलरासि ।।"),

                _buildSectionContents("चौपाई : "
                    "ए कपि सब सुग्रीव समाना ।\n"
                    "इन्ह सम कोटिन्ह गनइ को नाना ।।\n"
                    "राम कृपाँ अतुलित बल तिन्हहीं ।\n"
                    "तृन समान त्रेलोकहि गनहीं ।।\n"
                    "अस मैं सुना श्रवन दसकंधर ।\n"
                    "पदुम अठारह जूथप बंदर ।।\n"
                    "नाथ कटक महँ सो कपि नाहीं ।\n"
                    "जोन तुम्हहि जीतै रन माहीं ।।\n"
                    "परम क्रोध मीजहिं सब हाथा। \n"
                    "आयसु पै न देहिं रघुनाथा।।\n"
                    "सोषहिं सिंधु सहित झष ब्याला ।\n"
                    "पूरहीं न त भरि कुधर बिसाला ।।\n"
                    "मर्दि गर्द मिलवहिं दससीसा ।\n"
                    "ऐसेइ बचन कहहिं सब कीसा ।।\n"
                    "गर्जहिं तर्जहिं सहज असंका। \n"
                    "मानहु ग्रसन चहत हहिं लंका ।।"),

                _buildSectionContents("दोहा ५५ : "
                    "सहज सूर कपि भालु सब पुनि सिर पर प्रभु राम ।\n"
                    "रावन काल कोटि कहु जीति सकहिं संग्राम।।"),

                _buildSectionContents("चौपाई : "
                    "राम तेज बल बुधि बिपुलाई ।\n"
                    "सेष सहस सत सकहिं न गाई ।।\n"
                    "सक सर एक सोषि सत सागर ।\n"
                    "तव भ्रातहि पूँछेउ नय नागर ।।\n"
                    "तासु बचन सुनि सागर पाहीं ।\n"
                    "मागत पंथ कृपा मन माहीं ।।\n"
                    "सुनत बचन बिहसा दससीसा ।\n"
                    "जौं असि मति सहाय कृत कीसा ।।\n"
                    "सहज भीरु कर बचन दृढ़ाई। \n"
                    "सागर सन ठानी मचलाई ।।\n"
                    "मूढ़ मृषा का करसि बड़ाई ।\n"
                    "रिपु बल बुद्धि थाह मैं पाई ।।\n"
                    "सचिव सभीत बिभीषन जाकें ।\n"
                    "बिजय बिभूति कहाँ जग ताकें ।।\n"
                    "सुनि खल बचन दूत रिस बाढ़ी। \n"
                    "समय बिचारि पत्रिका काढ़ी ।।\n"
                    "रामानुज दीन्ही यह पाती। \n"
                    "नाथ बचाइ जुड़ावहु छाती ।।\n"
                    "बिहसि बाम कर लीन्ही रावन ।\n"
                    "सचिव बोलि सठ लाग बचावन ।।"),

                _buildSectionContents("दोहा ५६ (क) : "
                    "बातन्ह मनहि रिझाह सठ जनि घालसि कुल खीस।\n"
                    "राम विरोध न उबरसि सरन विष्नु अज ईस ।।"),

                _buildSectionContents("चौपाई : "
                    "की तजि मान अनुज व प्रभु पद पंकज भृंग।\n"
                    "होहि कि राम सरानल खल कुल सहित पतंग।।\n"
                    "सुनत सभय मन मुख मुसुकाई ।\n"
                    "कहत दसानन सबहि सुनाई ।।\n"
                    "भूमि परा कर गहत अकासा ।\n"
                    "लघु तापस कर बाग बिलासा ।।\n"
                    "कह सुक नाथ सत्य सब बानी ।\n"
                    "समुझहु छाड़ि प्रकृति अभिमानी ।।\n"
                    "सुनहु बचन मम परिहरि क्रोधा ।\n"
                    "नाथ राम सन तजहु बिरोधा ।।\n"
                    "अति कोमल रघुबीर सुभाऊ ।\n"
                    "जद्यपि अखिल लोक कर राऊ ।।\n"
                    "मिलत कृपा तुम्ह पर प्रभु करिही।\n"
                    "उर अपराध न एकउ धरिही ।।\n"
                    "जनकसुता रघुनाथहि दीजे।\n"
                    "एतना कहा मोर प्रभु कीजे ।।\n"
                    "जब तेहिं कहा देन वैदेही ।\n"
                    "चरन प्रहार कीन्ह सठ तेही ।।\n"
                    "नाइ चरन सिरु चला सो तहाँ ।\n"
                    "कृपासिंधु रघुनायक जहाँ ।।\n"
                    "करि प्रनामु निज कथा सुनाई।\n"
                    "राम कृपाँ आपनि गति पाई ।।\n"
                    "रिषि अगस्ति कीं साप भवानी।\n"
                    "राछस भयउ रहा मुनि ग्यानी ।।\n"
                    "बंदि राम पद बारहिं बारा ।\n"
                    "मुनि निज आश्रम कहुँ पगु धारा ।।"),

                _buildSectionContents("दोहा ५७ : "
                    "विनय न मानत जलधि जड़ गए तीन दिन बीति ।\n"
                    "बोले राम सकोप तब भय बिनु होइ न प्रीति ।।"),

                _buildSectionContents("चौपाई : "
                    "लछिमन बान सरासन आनू ।\n"
                    "सोषीं बारिधि बिसिख कृसानू ।।\n"
                    "सठ सन बिनय कुटिल सन प्रीती।\n"
                    "सहज कृपन सन सुंदर नीती ।।\n"
                    "ममता रत सन ग्यान कहानी।\n"
                    "अति लोभी सन बिरति बखानी ।।\n"
                    "क्रोधिहि सम कामिहि हरि कथा ।\n"
                    "ऊसर बीज बएँ फल जथा ।।\n"
                    "अस कहि रघुपति चाप चढ़ावा ।\n"
                    "यह मत लछिमन के मन भावा ।।\n"
                    "संघाने प्रभु बिसिख कराला ।\n"
                    "उठी उदधि उर अंतर ज्वाला ।।\n"
                    "मकर उरग झष गन अकुलाने ।\n"
                    "जरत जंतु जलनिधि जब जाने ।।\n"
                    "कनक थार भरि मनि गन नाना ।\n"
                    "बिप्र रूप आयउ तजि माना ।।"),

                _buildSectionContents("दोहा ५८ : "
                    "काटेहिं पढ़ कदरी फरह कोटि जतन कोउ सींच।\n"
                    "विनय न मान खगेस सुनु डाटेहिं पह नव नीच ।।"),

                _buildSectionContents("चौपाई : "
                    "सभय सिंधु गहि पद प्रभु केरे ।\n"
                    "छमहु नाथ सब अवगुन मेरे ।।\n"
                    "गगन समीर अनल जल धरनी।\n"
                    "इन्ह कइ नाथ सहज जड़ करनी ।।\n"
                    "तव प्रेरित मायाँ उपजाए।\n"
                    "सृष्टि हेतु सब ग्रंथनि गाए।।\n"
                    "प्रभु आयसु जेहि कहँ जस अहई।\n"
                    "सो तेहि भाँति रहे सुख लहई ।।\n"
                    "प्रभु भल कीन्ही मोहि सिख दीन्ही ।\n"
                    "मरजादा पुनि तुम्हरी कीन्ही ।।\n"
                    "ढोल गवाँर सूद्र पसु नारी ।\n"
                    "सकल ताड़ना के अधिकारी ।।\n"
                    "प्रभु प्रताप मैं जाब सुखाई ।\n"
                    "उतरिहि कटकु न मोरि बड़ाई ।।\n"
                    "प्रभु अग्या अपेल श्रुति गाई।\n"
                    "करौं सो बेगि जी तुम्हहि सोहाई ।।"),

                _buildSectionContents("दोहा ५९ : "
                    "सुनत विनीत वचन अति कह कृपाल मुसुकाइ ।\n"
                    "जेहि बिधि उतरै कपि कटकु तात सो कहहु उपाइ ।।"),

                _buildSectionContents("चौपाई : "
                    "नाथ नील नल कपि द्वी भाई ।\n"
                    "लरिकाई रिषि आसिष पाई ।।\n"
                    "तिन्ह के परस किएँ गिरि भारे ।\n"
                    "तरिहहिं जलधि प्रताप तुम्हारे ।।\n"
                    "मैं पुनि उर धरि प्रभुताई ।\n"
                    "करिहउँ बल अनुमान सहाई ।।\n"
                    "एहि बिधि नाथ पयोधि बँधाइअ ।\n"
                    "जेहिं यह सुजसु लोक तिहुँ गाइअ ।।\n"
                    "एहि सर मम उत्तर तट बासी ।\n"
                    "हतहु नाथ खल नर अघ रासी ।।\n"
                    "सुनि कृपाल सागर मन पीरा।\n"
                    "तुरतहिं हरी राम रनधीरा ।।\n"
                    "देखि राम बल पौरुष भारी ।\n"
                    "हरषि पयोनिधि भयउ सुखारी ।।\n"
                    "सकल चरित कहि प्रभुहि सुनावा।\n"
                    "चरन बंदि पाथोधि सिधावा ।।"),

                _buildSectionContents("छंद : "
                    "निज भवन गवनेउ सिंधु \n"
                    "श्रीरघुपतिहि यह मत भायऊ।\n"
                    "यह चरित कलि मलहर \n"
                    "जथामति दास तुलसी गायऊ ।।\n"
                    "सुख भवन संसय समन दवन \n"
                    "विषाद रघुपति गुन गना।।\n"
                    "तजि सकल आस भरोस गावहि \n"
                    "सुनहि संतत सठ मना ।।"),

                _buildSectionContents("दोहा ६० : "
                    "सकल सुमंगल दायक रघुनायक गुन गान।\n"
                    "सादर सुनहिं ते तरहिं भव सिंधु बिना जलजान।।"),

                _buildSectionTitle("मासपारायण, चौबीसवाँ विश्राम"),

                _buildSectionTitle(
                    "|| इति श्रीमद्रामचरितमानसे सकलकलिकलुषविध्वंसने पञ्चमः सोपानः समाप्तः ||")
              ],
            ),
          ),
        ),
      ),
      bottomNavigationBar: Column(
        mainAxisSize: MainAxisSize.min,
        children: [
          if (_currentIndex == 5)
            Padding(
              padding:
                  const EdgeInsets.symmetric(horizontal: 16.0, vertical: 8.0),
              child: Column(
                children: [
                  Text(
                    "Adjust Scroll Speed",
                    style: TextStyle(
                        color: _isBlackBackground ? Colors.white : Colors.black,
                        fontWeight: FontWeight.w500),
                  ),
                  Slider(
                    value: _scrollSpeed,
                    activeColor:
                        _isBlackBackground ? Colors.white : _themeColor,
                    inactiveColor: Colors.black.withOpacity(0.5),
                    min: 1.0,
                    max: 10.0,
                    divisions: 10,
                    label: _scrollSpeed.round().toString(),
                    onChanged: (double value) {
                      setState(() {
                        _scrollSpeed = value;
                      });
                    },
                  ),
                ],
              ),
            ),
          BottomNavigationBar(
            currentIndex: _currentIndex,
            onTap: _onBottomNavTap,
            items: [
              BottomNavigationBarItem(
                icon: Icon(Icons.sunny,
                    color: _isBlackBackground ? Colors.black : _themeColor),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.text_increase_outlined,
                    color: _isBlackBackground ? Colors.black : _themeColor),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.text_decrease,
                    color: _isBlackBackground ? Colors.black : _themeColor),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.share_outlined,
                    color: _isBlackBackground ? Colors.black : _themeColor),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.save,
                    color: _isBlackBackground ? Colors.black : _themeColor),
                label: '',
              ),
              BottomNavigationBarItem(
                icon: Icon(Icons.slideshow,
                    color: _isBlackBackground ? Colors.black : _themeColor),
                label: '',
              ),
            ],
          ),
        ],
      ),
    );
  }

  void _showColorSelectionDialog() {
    Map<Color, String> colorMap = {
      Colors.red: "Red",
      Colors.green: "Green",
      Colors.blue: "Blue",
      Colors.yellow: "Yellow",
      Colors.purple: "Purple",
      Colors.deepOrange: "Orange",
      Colors.teal: "Teal",
      Colors.brown: "Brown",
      Colors.cyan: "Cyan",
      Colors.indigo: "Indigo",
      Colors.amber: "Amber",
      Colors.lime: "Lime",
    };

    showDialog(
      context: context,
      builder: (BuildContext context) {
        return AlertDialog(
          title: const Text("Select Theme Color"),
          content: SizedBox(
            height: 400,
            width: double.maxFinite,
            child: GridView.count(
              crossAxisCount: 3,
              children: colorMap.entries.map((entry) {
                return _colorOption(entry.key, entry.value);
              }).toList(),
            ),
          ),
          actions: [
            TextButton(
              onPressed: () {
                Navigator.of(context).pop(); // Close the dialog
              },
              child: const Text("Close"),
            ),
          ],
        );
      },
    );
  }

  Widget _colorOption(Color color, String colorName) {
    return GestureDetector(
      onTap: () {
        setState(() {
          _themeColor = color; // Update the theme color
        });
        Navigator.of(context).pop(); // Close the dialog
      },
      child: Container(
        margin: const EdgeInsets.all(5),
        decoration: BoxDecoration(
          color: color,
          borderRadius: BorderRadius.circular(8),
        ),
        child: Center(
          child: Text(
            colorName,
            style: const TextStyle(color: Colors.white),
          ),
        ),
      ),
    );
  }

  Widget _buildSectionTitle(String title) {
    return Padding(
      padding: const EdgeInsets.only(right: 15, left: 15, top: 20, bottom: 5),
      child: Center(
        child: Text(
          title,
          style: TextStyle(
            fontSize: _textScaleFactor,
            fontWeight: FontWeight.bold,
            color: _isBlackBackground ? Colors.white : _themeColor,
          ),
        ),
      ),
    );
  }

  Widget _buildSectionContents(String content) {
    return Padding(
      padding: const EdgeInsets.symmetric(horizontal: 25, vertical: 20),
      child: Center(
        child: Column(
          children: [
            Text(
              content,
              style: TextStyle(
                fontWeight: FontWeight.normal,
                fontSize: _textScaleFactor,
                color: _isBlackBackground ? Colors.white : Colors.black,
              ),
              textAlign: _textAlign,
            ),
          ],
        ),
      ),
    );
  }

  Widget _buildSectionTitles(String content) {
    return Padding(
      padding: const EdgeInsets.symmetric(horizontal: 25, vertical: 20),
      child: Center(
        child: Text(
          content,
          style: TextStyle(
            fontWeight: FontWeight.bold, // Normal weight or adjust as needed
            fontSize: _textScaleFactor,
            color: _isBlackBackground ? Colors.white : Colors.black,
          ),
          textAlign: TextAlign.center,
        ),
      ),
    );
  }
}
